[{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-psycho-tech-3mm-gloves.html","name":"Psycho Tech 3mm Gloves","brand":"O'Neill","sku":"ONL5104","description":"The Psycho Tech 3mm Gloves are great for chilly waters and blocking the wind thanks to TechnoButter 3. You'll appreciate the added liner of TechnoButter Firewall which retains heat and quickly dries between surf sessions and the O'Ring seal that prevents flushing. These gloves are super durable and warm. They have a snug fit and we suggest you size-up from your normal size if you don't prefer a tight glove. With a little time, 1 - 2 years, these gloves will form fit to your hand.","price":"74.95","sizes":"XXS,XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/5/1/5104_002_f_web.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-psycho-tech-1-5mm-gloves-5103002.html","name":"Psycho Tech 1.5mm Gloves","brand":"O'Neill","sku":"ONL5103002","description":"Stay covered Head-to-Toe in O'Neill's premium lineup of equipment designed to shield you from the harshest conditions. Our world-class athletes search the planet for perfect surf, the R&D team at Area 52 developed product to allow you to perform in the most extreme elements and excel in the coldest climates.","price":"69.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/r/original-5103_002_p_1_1.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r2-yulex-2mm-gloves.html","name":"R2 Yulex 2mm Gloves","brand":"Patagonia","sku":"PAT89432","description":"Offering warmth and dexterity for cool-water surfing or kiting, the updated Patagonia R2 Yulex 2mm Gloves are now made from lighter and stretchier 2mm 85% natural rubber/15% synthetic rubber by polymer content with a fast-drying 100% recycled polyester lining; the exterior face fabric is stretchy and durable 88% recycled polyester/12% spandex. A 3-D silicone palm print maximizes grip, a micro gasket at the wrist helps prevent water entry, and articulated panels conform to the shape of the hand for a snug, drag-free fit. 100% external seam sealing eliminates leaks. All seams are triple glued and internally taped at high-stress areas for durability and strength. The natural rubber content is derived from sources that are Forest Stewardship Council certified by the Rainforest Alliance. Made in a Fair Trade Certified facility. Suggested water temperatures: 55–60° F/13–16° C.","price":"75","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/p/a/patagonia-wetsuits-r2-yulex-2mm-gloves.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-psycho-tech-5mm-mitten-gloves.html","name":"Psycho Tech 5mm Mitten Gloves","brand":"O'Neill","sku":"ONL5106002","description":"The Psycho Tech 5mm Mitten Gloves are great for chilly waters and blocking wind. The exterior neoprene is made with TechnoButter 3 for maximum stretch and a windproof smooth skin to block the wind. Lined with TechnoButter Firewall to retain heat and quickly dry between sessions. Tacky grip for popping up on your board, O'Ring seal to keep the water out. These gloves are super durable and warm.","price":"79.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/5/1/5106_002_f_web.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-seven-seas-3mm-gloves.html","name":"Seven Seas 3mm Gloves","brand":"Vissla","sku":"VISMWGLE3MG","description":"The Vissla Seven Seas 3mm Gloves are designed for surfers who don't like wearing gloves because these mitts feel more natural in cold water thanks to the 3mm of neoprene in a tailored fit. Naturally, they provide a bit of warmth for those chilly mornings with insulation that heats and a full thermal lining that dries fast so you don't have to worry about putting on cold wet gloves. Watertight cuffs keep water out so your hands stay warm and dexterous in cold water: 49 - 58° F / 9 - 14° C . And just like the rest of the Vissla wetsuit line, the Seven Seas Gloves are eco-friendly with naturally sourced Limestone and scrap rubber tires for the neoprene, dope dyed yarns, and responsible textile production.","price":"46.71","sizes":"M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/6/0/607189e98462111de019c6ebc8493050.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-wetsuits-e-bomb-2mm-gloves.html","name":"E-Bomb 2mm Gloves","brand":"Rip Curl","sku":"RIPWGL5SE","description":"Sleek and form fitting, the Rip Curl E-Bomb 2mm Gloves are a killer option for protection in cooler waters. These lightweight surf gloves are built with flexible E4 neoprene for a comfortable fit and have seams sealed with stitchless heat tape technology. The result is a leak resistant, quick drying glove that offers warmth for your hands when the temps start to drop.","price":"49.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/c/screenshot-2020-09-24-115324.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-3-2mm-gloves-wglycf.html","name":"Flashbomb 3/2mm Gloves - 2022","brand":"Rip Curl","sku":"RIPWGLYCF","description":"Don't let the cold keep you from epic winter swells. Rip Curl's Flashbomb 3/2 5 Finger Gloves are perfect for those cooler water temps. Constructed with their latest, flexible E6 neoprene, non-slip grip and seam sealed to keep your extremities warm on the coldest days.","price":"49.95","sizes":"M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-flashbomb-3-2-gloves-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-psycho-tech-5mm-lobster-gloves-5108002.html","name":"Psycho Tech 5mm Lobster Gloves","brand":"O'Neill","sku":"ONL5108002","description":"Stay covered Head-to-Toe in O'Neill's premium lineup of equipment designed to shield you from the harshest conditions. Our world-class athletes search the planet for perfect surf, the R&D team at Area 52 developed product to allow you to perform in the most extreme elements and excel in the coldest climates.","price":"79.95","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/r/original-5108_002_p_1.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-psycho-tech-5mm-gloves-5105.html","name":"Psycho Tech 5mm Gloves","brand":"O'Neill","sku":"ONL5105","description":"Stay covered Head-to-Toe in O'Neill's premium lineup of equipment designed to shield you from the harshest conditions. O'Neill's world-class athletes search the planet for perfect surf, the R&D team at Area 52 developed product to allow you to perform in the most extreme elements and excel in the coldest climates.","price":"79.95","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-psycho-tech-5mm-gloves-5105.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r3-yulex-3mm-gloves.html","name":"R3 Yulex 3mm Gloves","brand":"Patagonia","sku":"PAT89435","description":"The Patagonia R3 Yulex Gloves are made of light and stretchy natural rubber and a fast-drying lining. Articulated panels conform to your hand for a snug fit so you don't have to worry about drag or even cold hands and the thoughtful design includes internal and external seals, with a microgasket at the wrist to prevent water entry. You can also surf happily knowing that these gloves were sustainably made to outlast your underwear.","price":"79","sizes":"XS,S,M,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/3/r3_gloves_1.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-3-2mm-gloves-wgl1cf.html","name":"Flashbomb 3/2mm Gloves","brand":"Rip Curl","sku":"RIPWGL1CF","description":"The perfect companion for polar Search missions, the Flashbomb 3/2 five finger gloves are epic at keeping the session and circulation pumping! Designed with E6 flash lining for a cozy feel and quick-drying. These marine mittens are 3mm on palms and grip with 2mm cuffs that tuck into your wetsuit. They're seam sealed and external seam taped ensuring ultimate warmth.","price":"54.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-gloves-wgl1cf-flashbomb-3-2-gloves-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-dawn-patrol-3mm-gloves.html","name":"Dawn Patrol 3mm Gloves","brand":"Rip Curl","sku":"RIPWGLYBM","description":"The Dawn Patrol Glove is designed for surfers who prefer a simple five finger pair of gloves. Unlike gloves with wrist straps, the Dawn Patrol Gloves have an O-ring closure to keep water out. This is the perfect glove for the surfer who doesn't want to break the bank, but still demands a warm glove.","price":"44.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/g/wglybm.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r5-yulex-7mm-mitten-gloves.html","name":"R5 Yulex 7mm Mitten Gloves","brand":"Patagonia","sku":"PAT89441","description":"Now made of light, stretchy and ultrawarm 7mm 85% natural rubber/15% synthetic rubber by polymer content, the updated Patagonia R5 Yulex 7mm Mitten Gloves are designed for comfort and dexterity in the most frigid surf conditions. With a warm, fast-drying 100% recycled polyester thermal lining, the design keeps the fingers together for increased warmth and conforms to the hand for a snug fit. A 3-D silicone palm print maximizes grip, a micro gasket at the wrist helps prevent water entry, and 100% external seam sealing eliminates leaks. All seams are triple glued and internally taped at high-stress areas for durability and strength. The exterior face fabric is stretchy and durable 88% recycled polyester/12% spandex, and the face fabric and lining are now solution-dyed—using 86% less water than conventional dyeing. Both are laminated with water-based AquaA glue that’s free from harmful volatile organic compounds (VOCs). Natural rubber content is derived from sources that are Forest Stewardship Council certified by the Rainforest Alliance. Made in a Fair Trade Certified facility. Suggested water temperatures: 32–38° F/0–3° C.","price":"99","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/p/a/patagonia-wetsuits-r5-yulex-7mm-mitten-gloves.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-3mm-5-finger-gloves.html","name":"3mm 5 Finger Gloves","brand":"Buell","sku":"BULWGLO1233U001","description":"Make your sessions last longer with Buell 5-Finger Gloves! Let’s face it, no one wants to get the dreaded claw fingers-when your hands get so cold, they lose all their color and curl up, literally frozen! The value of cold-water protection for your paws is paramount. By donning a pair of Buell Gloves, you are treating your precious mitts to the luxurious feel and fit of Buell's premium “Ninja Neoprene” with its unparalleled warmth and freedom. Complete with the practical and trusty “Dura-Grip” textured palms, these gloves are guaranteed to accommodate even the most hardcore cold-water surfers, allowing them to keep both their core temps and performance levels high.","price":"56.95","sizes":"XS,S,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-3mm-5-finger-wetsuit-gloves-01_2.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-5-3mm-gloves.html","name":"Flashbomb 5/3mm Gloves","brand":"Rip Curl","sku":"RIPWGLYDF","description":"Don't let the cold keep you from epic winter swells. Rip Curl's Flashbomb 5/3 5 Finger Gloves are perfect for those cooler water temps. Constructed with their latest E6 Flash Lining, non-slip palms and seam sealed to keep your extremities warm on the coldest days.","price":"59.95","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/g/wglydf.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-seven-seas-5mm-3-finger-gloves.html","name":"Seven Seas 5mm 3 Finger Gloves","brand":"Vissla","sku":"VISMWGLE5MG","description":"Designed to keep you in the water longer the Vissla Seven Seas 5mm 3 Finger Gloves are lined with insulation and have a smooth skin, wind-resistant exterior, and watertight cuffs so you'll be safe from the cold. These gloves, like the rest of the Vissla wetsuit line, were made using eco-friendly neoprene naturally sourced from Limestone and constructed using dope dyed yarns.","price":"59.95","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/7/-/7-seas-5mm-claw-glove-black-4-c1c3.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-5mm-5-finger-gloves.html","name":"5mm 5 Finger Gloves","brand":"Buell","sku":"BULWGLO1255U","description":"This winter make your sessions last longer with Buell 5-Finger Gloves! Let’s face it, no one wants to get the dreaded claw fingers-when your hands get so cold, they lose all their color and curl up, literally frozen! The value of cold-water protection for your paws is paramount. By donning a pair of Buell Gloves, you are treating your precious mitts to the luxurious feel and fit of our premium “Ninja Neoprene” with its unparalleled warmth and freedom. Complete with the practical and trusty “Dura-Grip” textured palms, these gloves are guaranteed to accommodate even the most hardcore cold-water surfers, allowing them to keep both their core temps and performance levels high.","price":"64.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-5mm-5-finger-wetsuit-gloves-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-high-seas-1-5mm-gloves.html","name":"High Seas 1.5mm Gloves","brand":"Vissla","sku":"VISMWGLG1MG","description":"The Vissla High Seas 1.5mm Gloves are designed for surfers who do not like wearing gloves. Provides a bit of warmth for those chilly mornings. Made for cold water: 51 - 58° F / 11 - 14° C. These gloves, like the rest of the Vissla wetsuit line, were made using eco-friendly neoprene: naturally sourced Limestone and dope dyed yarns.","price":"40.46","sizes":"S,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/3/8/3850cb392e7515700311eafb3e849cca.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-2mm-5-finger-gloves-black-white-bone.html","name":"2mm 5 Finger Gloves - Black/White Bone","brand":"Buell","sku":"BULWGLO1222U043","description":"Winter is coming…make your sessions last longer with Buell Surf’s “Bones Glove”! Let’s face it, no one wants to get the dreaded claw fingers-when your hands get so cold, they lose all their color and curl up, literally frozen! The value of cold-water protection for your paws is paramount. By donning a pair of Buell “Rubber Bones Gloves”, you are treating your precious mitts to the luxurious feel and fit of our premium “Ninja Neoprene” with its unparalleled warmth and freedom. Complete with the practical and trusty “Dura-Grip” textured palms, these gloves are guaranteed to accommodate even the most hardcore cold-water surfers, allowing them to keep both their core temps and performance levels high.","price":"52.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-2mm-5-finger-wetsuit-gloves-skeleton-black-white-bone.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r4-yulex-5mm-3-finger-gloves.html","name":"R4 Yulex 5mm 3 Finger Gloves","brand":"Patagonia","sku":"PAT89440","description":"Now made from lighter and stretchier 5mm 85% natural rubber/15% synthetic rubber by polymer content, the updated Patagonia R4 Yulex 5mm 3 Finger Gloves provide essential warmth and dexterity for surfing or kiting in frigid conditions. Featuring a three-finger design for increased warmth, they have a fast-drying 100% recycled polyester thermal lining; the exterior face fabric is stretchy and durable 88% recycled polyester/12% spandex. The face fabric and lining are now solution-dyed—using 86% less water than conventional dyeing—and are laminated with water-based AquaA glue that’s free from harmful volatile organic compounds (VOCs). A 3-D silicone palm print maximizes grip, and articulated panels conform to the shape of the hand for a snug, drag-free fit. The micro gasket at the wrist helps prevent water entry, and 100% external seam sealing eliminates leaks. All seams are triple glued and internally taped at high-stress areas for durability and strength. The natural rubber content is derived from sources that are Forest Stewardship Council certified by the Rainforest Alliance. Made in a Fair Trade Certified facility. Suggested water temperatures: 38–48° F/3–9° C.","price":"89","sizes":"XS,S,M,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/9/89440_blk.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-7-5-mitten-gloves-wglyff.html","name":"Flashbomb 7/5 Mitten Gloves","brand":"Rip Curl","sku":"RIPWGLYFF","description":"Rip Curl's Flashbomb 7/5 Mittens are sure to keep your hands from cramping up in the coldest waters. Equipped with E6 Flash Lining you will experience ultimate warmth, stretch and comfort. Seams are sealed with silicon and reinforced with external tape. The 5mm sealed cuffs helps to ensure that water is locked out. The E6 flash Lining doesn't just provide warmth, it is also has 20% more stretch than E5. These premium features paired with gripped palms will keep your hands functional and comfortable for your entire session.","price":"59.95","sizes":"XS,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/g/wglyff.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-7mm-3-finger-lobster-gloves.html","name":"7mm Lobster 3 Finger Gloves","brand":"Buell","sku":"BULWLOB1377U","description":"This winter make your sessions last longer with Buell 7mm Lobster 3 Finger Gloves! Let’s face it, no one wants to get the dreaded claw fingers-when your hands get so cold, they lose all their color and curl up, literally frozen! The value of cold-water protection for your paws is paramount. By donning a pair of Buell Gloves, you are treating your precious mitts to the luxurious feel and fit of our premium “Ninja Neoprene” with its unparalleled warmth and freedom. Complete with the practical and trusty “Dura-Grip” textured palms, these gloves are guaranteed to accommodate even the most hardcore cold-water surfers, allowing them to keep both their core temps and performance levels high.","price":"68.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-7mm-lobsterglove-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-furnace-3mm-gloves.html","name":"Furnace 3mm Gloves","brand":"Billabong","sku":"BILABYHN00105","description":"Innovative design brings an unparalleled level of heat to the Billabong 3mm Furnace Wetsuit Gloves. Featuring the warmth of our exclusive Furnace Graphene combined with stretchy, super lightweight, recycled fabrics, this five finger glove offers optimum stretch with high-quality design for any cold water adventure.","price":"55.95","sizes":"XS,M,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/a/b/abyhn00105-blk-high-res.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-gauntlet-3-2mm-gloves-22016.html","name":"Gauntlet 3/2mm Gloves","brand":"Solite","sku":"STE22016","description":"The entire Solite glove line for Fall 2022-Winter 2023 has been redesigned for improved fit and flexibility along with unmatched grip, durability, and warmth. The Solite 3:2 Gauntlet Glove is designed for colder air/water temps where you want 5-finger dexterity but maximum warmth.","price":"89.95","sizes":"XS,S,M,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-gloves-22016l-2023-gauntlet-3-2mm-gloves-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-split-mitt-5-3mm-mitten-gloves-22017.html","name":"Split-Mitt 5/3mm Mitten Gloves","brand":"Solite","sku":"STE22017","description":"The entire Solite glove line for Fall 2022-Winter 2023 has been redesigned for improved fit and flexibility along with unmatched grip, durability, and warmth. The Solite 5:3 Split-Mitt is designed to keep your hands warm and flexible in all but the most arctic conditions.","price":"94.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-gloves-22017-2023-split-mitt-5-3mm-mitten-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-gauntlet-2-2mm-gloves-22018.html","name":"Gauntlet 2/2mm Gloves","brand":"Solite","sku":"STE22018","description":"The entire Solite glove line for Fall 2022-Winter 2023 has been redesigned for improved fit and flexibility along with unmatched grip, durability, and warmth. The Solite 2:2 Gauntlet Glove is designed for moderate air/water temps to extend your sessions with bare-handed feel and dexterity. The Gauntlet features all of the top-end features for grip, durability, and warmth but substitutes a thinner, quick-drying inner lining material for reduced bulk and improved feel of rails, bars, and paddles.","price":"84.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-gloves-22018-2023-gauntlet-2-2mm-gloves-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-5-3mm-3-finger-gloves-wglyef.html","name":"Flashbomb 5/3mm 3-Finger Gloves","brand":"Rip Curl","sku":"RIPWGLYEF","description":"Tacticly designed for maximum dexterity in cold waters, the Rip Curl Flash Bomb 5/3mm 3-Finger Gloves are optimal for seeking out and conquering frigid waves of perfection. Now made with internal E6 Flash Lining this seasons Flash Bomb Claw Glove is warmer, stretchier and lighter than ever before. The E6 Flash Lining is paired with internal seams sealed with silicon, and they externally taped, making them warmer than a 5 fingered glove and more capable than a mitten. Strategically tapered in thickness between cuff and hand for a less bulky, streamlined fit and then finished with a textured palm that delivers reliable grip, the Rip Curl Flash Bomb Gloves make keeping your hands warm easier than ever.","price":"59.95","sizes":"S,M,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/g/wglyef.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/hotline-plush-thermal-3mm-gloves.html","name":"Plush Thermal 3mm Gloves","brand":"Hotline","sku":"HOT173P","description":"The Hotline Plush Thermal 3mm Gloves has a cozy plush thermal lining for extra warmth on the extra cold days. Textured palm and fingers for a reliable grip. Durable and flexible neoprene with gel sealed seams keeping you toasty on the coldest days","price":"55.95","sizes":"XS,S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/g/l/glove_pair-688.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-seven-seas-7mm-mitten-gloves.html","name":"Seven Seas 7mm Mitten Gloves","brand":"Vissla","sku":"VISMWGLEMM7","description":"These are your cold water surf mittens, made for water 48° F and below. The Vissla Seven Seas 7mm Mitten Gloves are lined with insulation and have a smooth skin, wind-resistant exterior, and watertight cuffs so you'll be safe from the cold. The silicon palms lend to board grip and like the rest of the Vissla wetsuit line, these mittens were made using eco-friendly neoprene naturally sourced from Limestone and constructed using dope dyed yarns.","price":"59.95","sizes":"S,M,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/3/b3fef5bdf53d0c34f829e7fcbf6d177e.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-split-mitt-6-4mm-mitten-gloves-22019.html","name":"Split-Mitt 6/4mm Mitten Gloves","brand":"Solite","sku":"STE22019","description":"The entire Solite glove line for Fall 2022-Winter 2023 has been redesigned for improved fit and flexibility along with unmatched grip, durability, and warmth. The Solite 6:4 Split-Mitt is designed for the most frigid conditions mother nature can dish out.","price":"99.95","sizes":"XS,S,M,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-gloves-22019-2023-split-mitt-6-4mm-mitten-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/volcom-3mm-5-finger-gloves-a9932203.html","name":"3mm 5 Finger Gloves","brand":"Volcom","sku":"VOLA9932203","description":"The Volcom 3mm Five Finger Glove is made for seriously frigid waters and freezing conditions! Equipped with a 3mm mesh upper for minimal water absorption and thermal retention, the 3mm glove offers serious cold water protection. All seams are glued and blind stitched while the silicone wrist print offers a grip seal to keep your wetsuit sleeve connected.","price":"64.95","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/v/o/volcom-gloves-a9932203-3mm-5-finger-gloves-black.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-absolute-5mm-gloves-abyhn00118.html","name":"Absolute 5mm Gloves","brand":"Billabong","sku":"BILABYHN00118","description":"Designed to fit and feel like second skin, the Billabong 5mm Absolute Wetsuit Gloves keep your hands warm and functioning while you surf. These 5-finger wetsuit gloves feature sustainable PRO STRETCH, Superlight neoprene, silicon stretch lining for ultimate flex, watertight seams and logo branding for style.","price":"49.95","sizes":"XS,M,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-gloves-abyhn00118-absolute-5mm-gloves-black-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-2mm-gloves-abjhn00102.html","name":"Women's Synergy 2mm Gloves","brand":"Billabong","sku":"BILABJHN00102","description":"Prolong the ride with the Women's 2mm Synergy Gove. Retain dexterity and heat with this ultra-flexible wetsuit glove perfect for cold water sessions. Made with a Superlight foam core topped with recycled, Pro Stretch and Silicon Stretch fabric, the gloves offer premium stretch and value without sacrificing heat or style.","price":"39.95","sizes":"S,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-gloves-abjhn00102-wmns-synergy-2mm-gloves-black-01.jpg","style_id":"7","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/h2odyssey-magna-2mm-webbed-gloves.html","name":"Magna 2mm Webbed Gloves","brand":"H2Odyssey","sku":"H2OGK8","description":"The H20 Magna 2mm Webbed Gloves can be used to paddle the ocean or the pool.","price":"29.95","sizes":"S","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/h/2/h2odyssey-magna-2mm-webbed-gloves-01.jpg","style_id":"7","gender":"Womens"}]