[{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-hyperfreak-4-3-chest-zip-wetsuit.html","name":"Women's Hyperfreak 4/3+ Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5349","description":"The O'Neill Women's Hyperfreak 4/3+ Chest Zip Wetsuit is a women's specific performance suit and is constructed from super light TechnoButter 3 and TBX neoprene to give you maximum stretch. O'Neill added 0.5 mm extra of neoprene to this model as a step-up from your normal 4/3. The seams are glued and blindstitched and fully taped with TB3X tape to create an excellent barrier while maintaining your range of motion and flexibility. The Front Upper Zip Entry system uses a free-floating zipper panel and an anti-rash barrier with drain holes to keep you dry and feeling loose. The women's Hyperfreak has nice clean lines and a flattering fit: a Cleanline Surf favorite amongst us ladies.","price":"379.95","sizes":"4,6,8,8T,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/5/3/5348_a00_f_web_1_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-syncro-4-3-back-zip-wetsuit-erjw103085.html","name":"Women's Syncro 4/3 Back Zip Wetsuit","brand":"Roxy","sku":"RXYERJW103085","description":"Practical and affordable, the Roxy Women’s Syncro 4/3 Back Zip wetsuit is a popular seller for cool water surfers. Eco-friendly and flexible, the StretchFlight 2 neoprene is produced from scrap rubber tires. Stay warm while in the lineup covered in the comfortable WarmFlight thermal fleece. Thermal smoothie skin panels on the chest and back help block wind chill while absorbing solar rays for a cozy feel. Climb into the back entry with ease while zipping up in the YKK 10 plastic zip closure. StretchFlight 3 taped internal seams help make the suit comfortable and watertight.","price":"125.97","sizes":"2,4,6,8,8T","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/o/roxy-womens-4-3-syncro-bz-wetsuit-jetgrey-coralflame-templegold-02.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-epic-4-3-back-zip-wetsuit.html","name":"Women's Epic 4/3 Back Zip Wetsuit","brand":"O'Neill","sku":"ONL4214","description":"The Women's Epic has many of the same great features as O'Neill's high-end wetsuits, including 100% UltraFlex neoprene, double seal neck closure, LSD (lumbar seamless design) and re-engineered covert blackout zip. Clean graphics and sharp style lines make the Epic the best value in the industry.","price":"229.95","sizes":"2,4,6S,6,8S,8,8T,10S,10,10T,12S,12,12T,14,16","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-epic-4-3-back-zip-wetsuit-4214-blk-blk-blk-front_15.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-hyperfreak-fire-4-3-plus-chest-zip-wetsuit-5520.html","name":"Women's Hyperfreak Fire 4/3+ Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5520","description":"Keep your inner fire ignited with the Women's O'Neill Hyperfreak Fire 4/3+ Chest Zip Wetsuit. It prioritizes extreme warmth with the Technobutter 4 (TB4) Firewall while still having all the great features of the classic Hyperfreak. To optimize strength and heat, the TB4 is the next level up from the Technobutter 3. Recycled yarn in the internal liner is infused with graphene, creating a recirculating, fire-hot feedback loop with body heat. This new technology, combined with the exterior fluid seam weld, will stay red-hot, even on the coldest days.","price":"439.95","sizes":"4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-hyperfreak-fire-4-3-plus-chest-zip-blk-blk-front.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/sisstrevolution-women-s-seven-seas-4-3-back-zip-wetsuit-gn7s43bz.html","name":"Women's Seven Seas 4/3 Back Zip Wetsuit","brand":"Sisstrevolution","sku":"SISGN7S43BZ","description":"The Sisstrevolution Women’s Seven Seas 4/3 Back Zip wetsuit is a game changer when surfing in cool water. Step into the flexible 100% Super Stretch neoprene via the back zip entry and feel the warmth and comfort of the Thermal Stretch lining, located where it matters most: in the torso and upper leg. Stay toasty warm with the maximum water seal Super Stretch Neo 3.0 tape lining the internal seams.","price":"202.46","sizes":"4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/i/sisstrevolution-seven-seas-4-3-bz-wetsuit-solidblack-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-womens-dawn-patrol-4-3-back-zip-wetsuit.html","name":"Women's Dawn Patrol 4/3 Back Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSM9QW, RIPWSM9HS","description":"Rip Curl has some of the best women riders on their team so its no surprise that their suits offer unparalleled warmth and stretch in designs that keep you strong and confident in the water. The Rip Curl Women's Dawn Patrol 4/3 Back Zip Wetsuit is a great entry-level wetsuit for its combined performance features of warmth and durability and the back zip entry system is slightly easier than a chest zip if you're new to getting in and out of a wetsuit. This model also includes a batwing system providing a barrier between back zip and body to minimize leakage and flushing.","price":"202.46","sizes":"4,6,8,8T,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/d/p/dpbzblack_1_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-4-3-dawn-patrol-chest-zip-wetsuit.html","name":"Women's Dawn Patrol 4/3 Chest Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSM9BS, RIPWSM9NW","description":"The Rip Curl Women's Dawn Patrol 4/3 Chest Zip Wetsuit offers performance and warmth features along with durability and great value. It has many of the high-end features that you would find in Rip Curl's Ultimate wetsuits including all over E5 neoprene which is warmer, lighter and has 30% more stretch than E4. This suit also features front and back panels of quick drying E5 Flash lining paired with E4 Thermoflex lining providing comfortable stretch. For durability E5 tape is added to high-stress points, a major bonus for keeping water out and enforcing the strength and warmth of this high performance wetsuit. The chest zip entry system allows for easy entry with a low profile and helps prevent blow outs.","price":"269.95","sizes":"4,6,8,8T,10,10T,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-womens-dawn-patrol-4-3-chest-zip-wetsuit-slate-rose-01_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-psycho-tech-4-3-plus-chest-zip-wetsuit-5507.html","name":"Women's Psycho Tech 4/3+ Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5507","description":"Get psyched while surfing in the O'Neill Women's Psycho Tech 4/3 chest zip wetsuit. The suit ultimately focuses on warmth and durability. The sustainable TB4 Firewall technology from O’Neil retains and recirculates heat. O’Neil uses recycled ocean oyster shells and Aqua Alpha Solvent Free Neoprene Lamination to help reduce product emissions. The Psycho Tech is O’Neill’s premier wetsuit and has a cult following of enthusiasts who love it for its high-performance technology and performance.","price":"529.95","sizes":"4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-psycho-tech-4-3-plus-hooded-chest-zip-wetsuit-5507-blk-blk-front.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-salty-dayz-4-3-hooded-chest-zip-wetsuit-abjw200103.html","name":"Women's Salty Dayz 4/3 Hooded Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW200103","description":"Style and eco-friendly materials are sprinkled throughout the Billabong Women’s Salty Dayz 4/3 Hooded Chest Zip wetsuit. Billabong’s namesake Graphene Recycler Plus liner combined with Silicon Stretch interior fabric make for a remarkably warm and comfortable wetsuit. The partially recycled Superlight Foam is made from up-cycled tires for a flexible and lightweight feel. Internally, the suit features Super-Flex Neo Tape to seal out the cold water, while the Glued and Blind Stitched seams ensure flexibility from top to bottom.","price":"193.17","sizes":"4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw200103-wmns-salty-dayz-hdd-cz-jungle-night-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-swell-series-4-3-back-zip-wetsuit-erjw103124.html","name":"Women's Swell Series 4/3 Back Zip Wetsuit","brand":"Roxy","sku":"RXYERJW103124","description":"The Roxy Women’s Swell Series 4/3 wetsuit is constructed for immense warmth and protection through StretchFlight and thermal lining. Roxy created this suit using Xtra-stretch tape, GBS glue, water-based glue, and GlideSkin. These features combined created a high-performance masterpiece. Roxy is also using Recycled polyester and nylon for the lining of the Swell Series to lower environmental impact.","price":"269.95","sizes":"2,4,6,8,8T,10T,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/o/roxy-wetsuit-erjw103124-swell-series-4-3-bz-black-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-ninja-4-3-chest-zip-wetsuit.html","name":"Women's Ninja 4/3 Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5473","description":"The O'Neill Women's Ninja 4/3mm Chest Zip Wetsuit is part of the new Ninja series from O’Neill. The Ninja Series offers high-end quality features and exceptional durability at an affordable price. The 3/2 Ninja Chest Zip is made up of UltraFlex neoprene for freedom of movement. The suit has DL FluidFlex Firewall insulation in the torso and upper legs for insulation. Lastly, the suit is internally sealed using Ultraflex taped seams. Throw in O’Neill’s beloved F.U.Z.E entry system and a watertight double super seal neck closure you are left with an amazing suit at a competitive price.","price":"299.95","sizes":"4,6,8,8T,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-wmns-ninja-4-3-cz-wetsuit-blkblk-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-omega-4-3-back-zip-wetsuit.html","name":"Women's Omega 4/3 Back Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSM9CW","description":"The Women's Omega 4/3mm Wetsuit is a perfect introductory suit at an affordable price. Rip Curl incorporates high-end features such as; E5 and E3 neoprene, mesh skin panels, a hydro-loc collar, and E5 stress point tape to ensure comfort, warmth, and stretch. The back zip entry system makes it easy to get in and out of this suit, and with the added Batwing there is a barrier between your body and the zipper to keep you comfortable and prevent leakage and flushing. The hydro-loc collar is made of neoprene and further prevents leaking, while effectively holding up the batwing.","price":"169.96","sizes":"4,6,8,8T,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-womens-omega-4-3-back-zip-wetsuit-dusty-rose-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-4-3-back-zip-wetsuit-abjw100133.html","name":"Women's Synergy 4/3 Back Zip Wetsuit","brand":"Billabong","sku":"BILABJW100133","description":"If staying warm is your top priority, take a look at the Billabong Women’s Synergy 4/3 Back Zip wetsuit. Built for cold water, the Nobel Prize-winning Graphene material is placed in the chest and back liner which warms up quickly and has heat-producing properties to stay comfortable while waiting for the next set to come through. Partially recycled Superlight Foam neoprene has a soft buttery feel while maintaining an impressive flexible feel. The seams are pieced together with a non-toxic Superflex tape and glued and blind stitched external seams. Climb in the easy-to-use back zip entry and sprint out to the water in no time without breaking the bank.","price":"249.95","sizes":"2,4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100133kyh6-wmns-synergy-4-3-bz-wild-black-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-flashbomb-4-3-chest-zip-wetsuit.html","name":"Women's Flashbomb 4/3 Chest Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSTYF","description":"The Women's Flashbomb 4/3 Chest Zip wetsuit is now equipped E6 neoprene, fast drying E6 Flash lining, and E6 Flash Lining Tape. This suit provides unparalleled stretch, warmth and comfort in and out of the water. Rip Curl's E6 neoprene is 20% lighter than E4 while providing 30% more stretch so it won't compromise your mobility and flexibility while paddling out and catching a wave. The seams are also taped with E6 Flash Lining tape for extra comfort and water seam sealing. Perfect for cold water, this suit also utilizes mesh skin panels to absorb solar rays and reduce windchill. he Flash Bomb is our top-selling women's suit in the Rip Curl lineup, and with these updated features we're sure you'll love it for its warmth, technical features, and quick-drying ability.","price":"469.95","sizes":"4,6,8,8T,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-wstyfs-womens-flashbomb-4-3-chest-zip-wetsuit-washed-black-01_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-4-3-chest-zip-wetsuit-abjw100130.html","name":"Women's Synergy 4/3 Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW100130","description":"The Women’s 4/3 Synergy Chest Zip Wetsuit from Billabong is designed for those who seek lightweight, premium warmth and performance. Reap all of these benefits without having to break your wallet; this wetsuit boasts stretchy neoprene fabric with glued & blind stitched sealed external seams and a graphene recycler lining at the front & back panels that boosts strength while trapping in heat. Silicone-stretch arm & leg panels make it easy to slide into or out of while being mindful towards sustainability as well!","price":"269.95","sizes":"2,4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100130-wmns-synergy-4-3-cz-wild-black-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-salty-dayz-4-3-chest-zip-wetsuit-abjw100122.html","name":"Women's Salty Dayz 4/3 Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW100122","description":"Built with style and designed for top performance, the Billabong Women’s Salty Dayz 4/3 Chest Zip wetsuit is a hidden gem for cold water surfers. Eco-friendly materials such as the partially recycled Superlight Foam neoprene and water-based glue are pieced throughout the suit. High-tech features like the Graphene liner provide unmatched warmth while paddling out in the morning chill. Climb into the water-tight chest zip entry which is simple to navigate with the chest panel designed with a generous opening. External glued and blind stitched seams along with Super Flex neo tape on the inside ensure watertight seams resulting in a warmer suit.","price":"188.47","sizes":"2,4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100122kyg6-salty-dayz-4-3-cz-jungle-night-01_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-women-s-r3-yulex-4-5-3-5-chest-zip-wetsuit.html","name":"Women's R3 Yulex 4.5/3.5 Chest Zip Wetsuit","brand":"Patagonia","sku":"PAT88531","description":"Patagonia’s completely redesigned their women’s wetsuits, which now feature a breezy asymmetrical entrance (they slide on and off with ease), a new fit and an ultra-soft 100% recycled polyester internal lining that feels like a second skin. The Women’s 4.5m/3.5mm R2® Yulex® Front-Zip is for water in the 48-55 degrees Fahrenheit range. This is for the surfer who wants to get in the water faster, surf longer and wear a suit that leaves a lighter impact on the environment than ever before.","price":"311.4","sizes":"4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/8/88531-w_s-r3-yulex-fz-full-suit.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-salty-dayz-natural-4-3-chest-zip-wetsuit-abjw100161.html","name":"Women's Salty Dayz Natural 4/3 Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW100161","description":"Sustainability meets stretchable performance in the Women’s Salty Dayz Natural Series Full 4/3 Wetsuit. 100% neoprene-free, this natural rubber women's wetsuit made from Yulex delivers all the warmth and flexibility you find in a premium wetsuit without the toxic chemicals. This eco and performance-minded wetsuit is backed by Recycler Graphene Comp stretch lining. Easy on and off paves the way for a front zip entry system for a smooth feel and extra flexibility. Sealed with water-based glues and 100% taped internal seams, the Salty Dayz Natural Full Wetsuit is the most sustainably focused suit you’ll wear.","price":"389.95","sizes":"2,4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100161kvd7-salty-dayz-natural-4-3-cz-black-tide-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-flashbomb-e7-heatseeker-4-3-zip-free-wetsuit-wst5yw.html","name":"Women's Flashbomb E7 HeatSeeker 4/3 Zip Free Wetsuit","brand":"Rip Curl","sku":"RIPWST5YW0090","description":"Catch a wave in a flash with the Women’s Flashbomb E7 HeatSeeker 4/3 Zip Free Wetsuit. Combining the new E7 Flash Lining throughout the wetsuit and a unique version of 2 Flex Energy, a revolutionary suit has been created. With superior technical features, the Flashbomb Heat Seeker is Rip Curl’s warmest and stretchiest Flashbomb wetsuit ever created.","price":"519.95","sizes":"4,6,8,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-wst5yw-flashbomb-heat-seeker-4-3-zip-free-wetsuit-black-02.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-e-bomb-4-3-zip-free-wetsuit-wsmyig.html","name":"Women's E-Bomb 4/3 Zip Free Wetsuit","brand":"Rip Curl","sku":"RIPWSMYIG","description":"Rip Curl's E-Bomb ultimate super stretch high performance wetsuit is now made with the latest E6 neoprene. This suit has 25% more stretch and is 15% lighter than suits made with E5 neoprene. The E6 Thermo Lining throughout the entire suit is fast drying, warm, and has a comfortable stretch. E6 tape and stress point hand taping ensures the durability of the E-Bomb so you can keep it as your go to, and get out on the water often. The zip free technology offers light, unrestricted performance and efficient design for maximum stretch warmth, and comfort. This wetsuit is perfect for keeping you mobile throughout the seasons and in cold water. Enjoy your paddling freedom with the new underarm torpedo gusset panel which provide increased comfort and improved fit.","price":"349.95","sizes":"4,6,8,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-womens-4-3-e-bomb-zip-free-wetsuit-black-01_5.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-furnace-comp-4-3-chest-zip-wetsuit-abjw100147.html","name":"Women's Furnace Comp 4/3 Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW100147","description":"To stay warm and perform your best, you need a wetsuit that's lightweight, super flexible, and built to handle the action. The 4/3 Women's Furnace Comp Series Chest Zip Full Wetsuit rises to the challenge with AIRLITE 4D exterior, a SMART foam core, and a technical Graphene interior. Reinforced with Super-flex taped seams. Specifically designed for cold water, loaded with the latest features all designed to keep you the warmest most comfortable possible.","price":"419.95","sizes":"4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100147-wmns-furnace-comp-4-3-cz-midnight-trails-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rbz-stealth-mode-4-3-back-zip-wetsuit-wrbz0143w.html","name":"Women's RBZ Stealth Mode 4/3 Back Zip Wetsuit","brand":"Buell","sku":"BULWRBZ0143W","description":"Feel like a true surfing ninja in the Women's RBZ Stealth Mode 4/3 Back Zip Wetsuit. The back zip creates a quick and efficient entry, allowing more time surfing and less time changing. The environmentally conscious, limestone-based Ninja Neoprene reduces water absorption by 30%, allowing for prolonged sessions. An added feature of integrating rubber seals into the sleeves minimizes flushing and maximizes warmth during cold water sessions.","price":"161.21","sizes":"4,8,8T","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-rbz-stealth-mode-4-3-womens-wetsuit-aqua-black-frontside.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-blueprint-4-3-plus-chest-zip-wetsuit-5501.html","name":"Women's Blueprint 4/3+ Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5501","description":"Promote sustainability with the new O'Neill Women's Blueprint 4/3+ Chest Zip Wetsuit. The Women’s Blueprint 4/3+ offers mind-boggling minimal seams, flexibility, and warmth. O’Neil did a great job at creating an eco-friendly wetsuit. The TB4 Air Firewall technology improves durability and warmth. Altogether, the Women’s Blueprint 4/3 Chest Zip Wetsuit is the warmest, highest-performing sustainable wetsuit to date.","price":"589.95","sizes":"4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-wetsuit-wmns-blueprint-4-3-plus-chest-zip-blk-shade-front.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rb2-4-3-hooded-chest-zip-wetsuit-wrb20243w.html","name":"Women's RB2 4/3 Hooded Chest Zip Wetsuit","brand":"Buell","sku":"BULWRB20243W","description":"Perfect for those with extra warm souls, the Women's Buell RB2 4/3 Hooded Chest Zip Wetsuit features flexibility and water-tight technology to prolong your session. The limestone-based Ninja Neoprene is eco-friendly and allows 30% less water absorption resulting in a quicker drying time. The glued and blindstitched seams are top-of-the-line, and with the power-lite “Sizzle” seam seal, this suit maintains durability while keeping you toasty warm during your cold water sessions.","price":"289.95","sizes":"4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-rb2-womens-wetsuit-black-front_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-furnace-natural-4-3-zip-free-wetsuit-abjw100137.html","name":"Women's Furnace Natural 4/3 Zip Free Wetsuit","brand":"Billabong","sku":"BILABJW100137","description":"With the Billabong Women’s Furnace Natural 4/3 Zip Free Wetsuits, sustainability matters. Without compromising performance, the Women’s furnace Natural is the most sustainable-focused suit you’ll wear. The majority of the Women's Furnace is made with Yulex rubber. Yulex rubber delivers the flex and warmth of premier suits while maintaining a low carbon footprint.","price":"314.97","sizes":"4,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-womens-furnace-natural-4-3-zip-free-bilabjw100137bsd2-wetsuit-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-furnace-comp-4-3-chest-zip-wetsuit-abjw100125.html","name":"Women's Furnace Comp 4/3 Chest Zip Wetsuit - 2021","brand":"Billabong","sku":"BILABJW100125","description":"Boost your heat and your airs with the 4/3 Women's Furnace Comp Series Chest Zip Full Wetsuit. Delivering on sustainability without sacrifice, this cold-water competition performance wetsuit for women is now made with innovative eco-conscious materials. Geared for competition, the cold water full wetsuit is lined at the front and back panels with incredibly lightweight and strong Graphene-infused yarns, now infused with 100% recycled fibers, keeping you warmer and faster for longer. Made from upcycled car tires, the eco-conscious SMART Foam is topped with AIRLITE Recycler jersey, now made from recycled materials, radically reducing both weight and wind chill. A chest zip entry system allows for an easy on-off. Every layer is constructed with incredible flexibility for optimal performance.","price":"258.97","sizes":"2,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-womens-furnace-comp-4-3-chest-zip-wetsuit-01.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rbz-stealth-mode-4-3-back-zip-wetsuit-2020.html","name":"Women's RBZ Stealth Mode 4/3 Back Zip Wetsuit - 2020","brand":"Buell","sku":"BULWRBZ0143W0","description":"Experience better, faster surfing with the Buell Women's RBZ Stealth Mode 4/3 Back Zip Wetsuit. Save time and enter quicker due to its easy-access back zip design. Plus, don't worry about losing your warmth - Ninja Neoprene, made from limestone, reduces water absorption by 30% for those long days in cooler waters! Add on rubber seals integrated into the sleeves that minimize flushing, and you have a suit fit for true surf ninjas!","price":"142.46","sizes":"4,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-womens-rbz-stealth-mode-3-2-wetsuit-black_darkgrey-01_1.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rb2-4-3-hooded-chest-zip-wetsuit-2020.html","name":"Women's RB2 4/3 Hooded Chest Zip Wetsuit - 2020","brand":"Buell","sku":"BULWRB20243W0010","description":"The Women's 4/3 RB2 Hooded chest zip wetsuit is Buells most water tight wetsuit built for barrels. Featuring Ninja Neoprene, chest and back panels of internal thermal insulation barrier, and a water tight slant zip entry system this wetsiot pushes the limits of warmth potential.","price":"203.16","sizes":"4,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-womens-rb2-4-3-hooded-wetsuit-black-01_7.jpg","style_id":"3","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/sisstrevolution-women-s-seven-seas-4-3-chest-zip-wetsuit-gn7s43cz.html","name":"Women's Seven Seas 4/3 Chest Zip Wetsuit","brand":"Sisstrevolution","sku":"SISGN7S43CZ","description":"Sisstrevolution's Women’s Seven Seas 4/3 Chest Zip Wetsuit offers the perfect combination of superior performance and exceptional comfort. Crafted from lightweight, warm 100% Super stretch Japanese limestone based neoprene with a Thermal Fever Fiber lining to help insulate heat, this tailored fit suit allows for unrestricted movement while benefiting from softer eco-friendly materials laminated using AquaA solvent-free water-based lamination approved by Bluesign mills – ideal for those seeking out an ecologically responsible wetsuit option.","price":"186.71","sizes":"4","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/f/i/fix-main1_1_6.jpg","style_id":"3","gender":"Womens"}]