[{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-cleanline-synergy-5-4-back-zip-wetsuit-abjw100163.html","name":"Women's Cleanline Synergy 5/4 Back Zip Wetsuit","brand":"Billabong","sku":"BILABJW100163","description":"Unique only to Cleanline Surf is the Billabong Women's Cleanline Synergy 5/4 back zip wetsuit. The Nobel Prize-winning Graphene material is placed in the chest and back liner, which warms up quickly and has heat-producing properties to stay comfortable while waiting for the next set to come through. Partially recycled Superlight Foam neoprene has a soft buttery feel while maintaining an impressive flexible feel. Non-toxic Superflex tape and glued and blind-stitched external seams result in good flex from head to toe. Climb in the easy-to-use back zip entry and sprint out to the water in no time without breaking the bank.","price":"215.96","sizes":"2,4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100163blk-wmns-cleanline-synergy-5-4-bz-black-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-hyperfreak-5-5-4-hooded-chest-zip-wetsuit-5478.html","name":"Women's Hyperfreak 5.5/4+ Hooded Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5478","description":"The O'Neill Women's Hyperfreak 5.5/4+ Chest Zip Hooded Wetsuit is the most performance-oriented wetsuit made for women. The suit is constructed with super light TechnoButter 3 in the legs and torso and TB3X neoprene in the arms and shoulders. This allows for maximum paddle ability and minimal weight, two critical factors concerning cold water wetsuits. The minimal seam design, overall lightweight, quality construction, and attention to detail make this a favorite among women who love surfing in cold water.","price":"439.95","sizes":"4,6S,6,8S,8,8T,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-hyperfreak-55-4-chest-zip-graph-dstyblu-wetsuit-front.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-5-4-hooded-chest-zip-wetsuit-abjw200100.html","name":"Women's Synergy 5/4 Hooded Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW200100","description":"Keep your performance at its peak in cold water with the Billabong Women’s 5/4 Synergy Hooded Chest Zip Wetsuit. Made from stretchy Superflex Jersey and eco-friendly materials, this full wetsuit features strategically placed seams and advanced construction techniques to ensure warmth without compromising on movement capability. Heat is also maximized through graphene recycler lining across front and back panels as well as added reinforcement of glued blind stitched high-stress areas plus an easy chest zip entry for seamless transitions.","price":"299.95","sizes":"2,4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw200100-wmns-synergy-5-4-hdd-cz-marine-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-syncro-5-4-3-back-zip-wetsuit-erjw103084.html","name":"Women's Syncro 5/4/3 Back Zip Wetsuit","brand":"Roxy","sku":"RXYERJW103084","description":"There’s a reason the Roxy Women’s Syncro 5/4/3 Back Zip wetsuit is a top seller at Cleanline Surf; it packs in everything needed in a cold water suit at an affordable price. With the eco-friendly StretchFlight 2 neoprene combined with the WarmFlight thermal fleece liner, the Syncro maintains flexibility, warmth, and a comfortable feel while hanging 10 on your favorite longboard. The seams stay watertight and hold in the heat through the use of StretchFlight 3 Taping and glued and blind stitched external seams.","price":"157.46","sizes":"2,4,6,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/o/roxy-womens-5-4-3-syncro-bz-wetsuit-jetblack-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-dawn-patrol-5-3-back-zip-wetsuit.html","name":"Women's Dawn Patrol 5/3 Back Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSM9PW","description":"Rip Curl has some of the best women riders on their team so its no surprise that their suits offer unparalleled warmth and stretch in designs that keep you strong and confident in the water. The Rip Curl Women's Dawn Patrol 5/3 Back Zip Wetsuit is a great entry-level wetsuit for its combined performance features of warmth and durability and the back zip entry system is slightly easier than a chest zip if you're new to getting in and out of a wetsuit. This model also includes a batwing system providing a barrier between back zip and body to minimize leakage and flushing.","price":"251.96","sizes":"4,6,8,8T,10,10T,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/d/p/dpbzblack_1.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/sisstrevolution-women-s-seven-seas-5-4-hooded-chest-zip-wetsuit-gn7s54hc.html","name":"Women's Seven Seas 5/4 Hooded Chest Zip Wetsuit","brand":"Sisstrevolution","sku":"SISGN7S54HC","description":"Brave the icy cold swell while staying cozy warm in the Sisstrevolution Women’s Seven Seas 5/4 Hooded Chest Zip wetsuit. Soft and flexible to the touch, the 100% Super Stretch Japanese neoprene is super comfortable to help prolong those epic sessions. Don’t sweat if you run cold; the Fever Fiber internal liner, smoothy panels, and Super Stretch Neo 3.0 taped seams all contribute to creating a toasty warm suit. The female-specific tailored fit ensures the most comfortable fit resulting in optimal movement from head to toe.","price":"228.71","sizes":"2,4,6,8","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/i/sisstrevolution-wmns-7seas-5-4-hdd-cz-solidblack-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-prologue-5-4-3-back-zip-wetsuit-erjw103073.html","name":"Women's Prologue 5/4/3 Back Zip Wetsuit","brand":"Roxy","sku":"RXYERJW103073","description":"With the latest wetsuit technology in mind, the women’s back zip Prologue Collection is a surf essential. A sporty blend of FREEMAX neoprene and HYPERSTRETCH 3.0 make the Women’s Prologue 5/4/3 a stretchy and comfortable option. The Triple glued & single -blind stitched seams penetrate neoprene to reduce water entry and improve durability. The Prologue 5/4/3 includes a back zip entry with a YKK #10 plastic zipper. Lightweight Supertex Knee pads are also implemented into the Roxy Prologue for protection and performance.","price":"219.95","sizes":"4,6,8,8T,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/o/roxy-wetsuit-erjw103073kvj0-wmns-prologue-5-4-3-bz-black-02.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-women-s-r4-yulex-5-5-4-hooded-chest-zip-wetsuit.html","name":"Women's R4 Yulex 5.5/4 Hooded Chest Zip Wetsuit","brand":"Patagonia","sku":"PAT88527","description":"This 5.5mm/4mm cold-water wetsuit features all-new updates including ease of entry and a new fit. The suit’s designed to slip on fast, which you’ll be thankful for because if you are wearing this suit, it’s likely pretty cold. Patagonia’s Women’s R4® Yulex® Hooded Front-Zip is a wetsuit that’ll keep you warm and, in the water, longer, even when the temp drops below 40 drips (Fahrenheit, that is).","price":"353.4","sizes":"4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/8/88527-w_s-yulex-r4-fz-hooded-full-suit.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-psycho-tech-5-5-4-plus-hooded-chest-zip-wetsuit-5508.html","name":"Women's Psycho Tech 5.5/4+ Hooded Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5508","description":"Stay psyched with the O'Neill Women’s Psycho Tech 5.5/4+ Hooded Chest Zip Wetsuit. The women's Psycho Tech 5.5/4 hooded wetsuit ultimately focuses on warmth and durability. The sustainable TB4 Firewall technology from O’Neill retains and recirculates heat. O’Neill uses recycled ocean oyster shells and Aqua Alpha Solvent Free Neoprene Lamination to help reduce product emissions. The Psycho Tech is O’Neill’s premier wetsuit and is loved by enthusiasts for its high-performance technology.","price":"539.95","sizes":"4,6,8,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-psycho-tech-5_5-4-plus-hooded-chest-zip-wetsuit-5508-blk-blk-front.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-5-4-dawn-patrol-hooded-chest-zip-wetsuit.html","name":"Women's 5/4 Dawn Patrol Hooded Chest Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSMYHW","description":"The Rip Curl Women's Dawn Patrol 5/4 Hooded Chest Zip Wetsuit offers performance and warmth features along with durability and great value. It has many of the high-end features that you would find in Rip Curl's Ultimate wetsuits including all over E5 neoprene which is warmer, lighter and has 30% more stretch than E4. This suit also features front and back panels of quick drying E5 Flash lining paired with E4 Thermoflex lining providing comfortable stretch. For durability E5 tape is added to high-stress points, a major bonus for keeping water out and enforcing the strength and warmth of this high performance wetsuit.","price":"319.95","sizes":"4,6,8,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/s/wsmyhw.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-swell-series-5-4-3-back-zip-wetsuit-erjw103127.html","name":"Women's Swell Series 5/4/3 Back Zip Wetsuit","brand":"Roxy","sku":"RXYERJW103127","description":"Paddle out in a breeze after climbing into the all-new Roxy Women’s Swell Series 5/4/3 back zip wetsuit. Zip close the durable YKK 10 plastic zipper while feeling the comfortable Eco sleek WarmFlight internal liner against your skin. Externally, the Eco StretchFlight neoprene is engineered to protect from cold ocean water and features feminine designs on the shoulders and arms. Feel good about the eco-friendly materials that make up the Swell, with the recycled polyester and nylon in the liner and water-based glue used in the seam construction. Look good and feel even better in the Roxy Swell Series.","price":"289.95","sizes":"2,4,6,8,8T,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/o/roxy-wetsuit-erjw103127-swell-series-5-4-3-bz-black-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-flashbomb-5-4-hooded-chest-zip-wetsuit.html","name":"Women's Flashbomb 5/4 Hooded Chest Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSTYDG","description":"The Women's Flashbomb 5/4mm Hooded Chest Zip wetsuit is now equipped E6 neoprene, fast drying E6 Flash lining, and E6 Flash Lining Tape. This suit provides unparalleled stretch, warmth and comfort in and out of the water. Rip Curl's E6 neoprene is 20% lighter than E4 while providing 30% more stretch so it won't compromise your mobility and flexibility while paddling out and catching a wave. The seams are also taped with E6 Flash Lining tape for extra comfort and water seam sealing. Perfect for cold water, this suit also utilizes mesh skin panels to absorb solar rays and reduce windchill. he Flash Bomb is our top-selling women's suit in the Rip Curl lineup, and with these updated features we're sure you'll love it for its warmth, technical features, and quick-drying ability.","price":"499.95","sizes":"4,6,8,10,12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/s/wstydgmain.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-ninja-5-4-hooded-chest-zip-wetsuit-5526.html","name":"Women's Ninja 5/4 Hooded Chest Zip Wetsuit","brand":"O'Neill","sku":"ONL5526","description":"O’Neill always puts out top-of-the-line products with top-of-the-line costs, but the Women's Ninja 5/4 Hooded Chest Zip Wetsuit prioritizes affordability. Don’t fret; it still has O’Neill’s top features; UltraFlex neoprene, internal Ultraflex taped seams, DL FluidFlex Firewall insulation, and double super seal neck closure. Although it’s missing the beloved Technobutter, the Ultraflex provides similar flexibility with increased durability. Make sure to snag the stealthy good deal on the Ninja suite before it’s gone.","price":"329.95","sizes":"4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-ninja-5-4-hooded-chest-zip-wetsuit-blk-blk-front.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-furnace-5-4-hooded-chest-zip-wetsuit-abjw200104.html","name":"Women's Furnace 5/4 Hooded Chest Zip Wetsuit","brand":"Billabong","sku":"BILABJW200104","description":"To stay warm and perform your best, you need a wetsuit that's lightweight, super flexible, and built to handle the action. The Billabong 5/4 Women's Furnace Comp Series Hooded Chest Zip Full Wetsuit rises to the challenge with AIRLITE 4D exterior, a SMART foam core, and a technical Graphene interior. Reinforced with Super-flex taped seams.","price":"499.95","sizes":"2,4,6,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw200104kvj6-wmns-furnace-5-4-hdd-cz-midnight-trails-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-swell-series-5-4-3-hooded-chest-zip-wetsuit-erjw203012.html","name":"Women's Swell Series 5/4/3 Hooded Chest Zip Wetsuit","brand":"Roxy","sku":"RXYERJW203012","description":"Feminine flare and high-end features make up the Roxy Women’s Swell Series 5/4/3 hooded chest zip wetsuit. The Swell is an update from the former Syncro, which has been a Cleanline Surf best-seller for years. While paddling out, feel the comfort and warmth radiate from the Eco StretchFlight neoprene and WarmFlight thermal lining. GBS glued and blind stitched seams along with xtra-stretch taping hold the suit together session after session. The unique chest zip entry completely detaches from the front of the suit, which makes for easier maneuvering in and out of the wetsuit.","price":"309.95","sizes":"2,4,6,8,8T,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/o/roxy-womens-swell-series-5-4-3-hooded-chest-zip-wetsuit-erjw203012-black-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-5-4-back-zip-wetsuit-abjw100134.html","name":"Women's Synergy 5/4 Back Zip Wetsuit","brand":"Billabong","sku":"BILABJW100134","description":"For the best in performance, heat, and value, there's no beating the 5/4 Synergy Back Zip Full Wetsuit. Delivering peak flexibility without sacrificing warmth, this women's wetsuit is made with recycled PRO STRETCH! exterior and a Superlight foam core, adding seams for ultimate durability and a back zip for easy entry.","price":"269.95","sizes":"2,4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-wetsuit-abjw100134-wmns-synergy-5-3-bz-wild-black-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rb2-5-4-hooded-chest-zip-wetsuit-wrb20254w.html","name":"Women's RB2 5/4 Hooded Chest Zip Wetsuit","brand":"Buell","sku":"BULWRB20254W","description":"The Women's Buell RB2 5/4 Hooded Chest Zip Wetsuit makes for a high-quality, eco-friendly, and affordable wetsuit. The slant zip entry provides water-tight warmth while making it easy to take on and off. The lime-stone-based Ninja Neoprene allows 30% less water absorption resulting in a quicker drying time. Buell prioritizes comfort without compromising durability with a soft and fuzzy thermal liner, external seam weld, and glued and blindstitched seams.","price":"299.95","sizes":"4,6,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-rb2-womens-wetsuit-black-front.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/sisstrevolution-women-s-seven-seas-5-4-hooded-chest-zip-wetsuit.html","name":"Women's Seven Seas 5/4 Hooded Chest Zip Wetsuit","brand":"Sisstrevolution","sku":"SISGNMS54HC","description":"The Sisstrevolution Women’s 5/4 Hooded Chest Zip wetsuit contains all the features needed in a quality cold water suit. From the flexible 100% Super Stretch Light neoprene to the toasty warm and quick drying Fever Fiber lining, this suit quickly zaps the chill of sub 50F water temperatures. The Super Stretch Neo 2.0 Tape provides optimal warmth and maximum paddling flexibility. With sustainability in mind, the suit is produced with dope-dyed fabric and manufactured in Bluesign-approved mills.","price":"224.21","sizes":"4,6,8","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/i/sisstrevolution-5-4-hooded-chest-zup-wetsuit-strongblue-01.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/hotline-women-s-ultra-hot-combo-5-4-hooded-wetsuit.html","name":"Women's Ultra Hot Combo 5/4 Hooded Wetsuit","brand":"Hotline","sku":"HOTWH5401","description":"If you're a lady who struggles with finding a hooded wetsuit that fits properly in the shoulders, chest, and neck, this is for you. Tried and true in extreme conditions, the Hotline Women's Ultra Hot Combo 5/4 Hooded Chest Zip Wetsuit is designed with top of the line materials for the greatest comfort and highest degree of warmth. The UHC includes a built-in drawstring hood and full shoulder-to-shoulder zipper for quick entry and exit when it's frigid. A freeze-free inner panel offers extra protection in water from 32 to 52 degrees. Never miss another day of perfect icy waves!","price":"373.96","sizes":"4,8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/f/r/front_9_7.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rb2-5-4-hooded-chest-zip-wetsuit-2020.html","name":"Women's RB2 5/4 Hooded Chest Zip Wetsuit - 2020","brand":"Buell","sku":"BULWRB20254W0012020","description":"Buells ultimate year round wetsuit, RB2, is their warmest most watertight wetsuit yet. In order to push the barriers of this wetsuit's warmth potential \"Ninja Neoprene\" is used in combination with an internal thermal insulation barrier. The slant zip entry gives you a one-sided water seal to lock out the cold water, while the seams are glued and blind stitched with power-lite \"Sizzle\" seam seal on the outside. The RB2 is built for endless barrels.","price":"270.95","sizes":"8","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell_2.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-women-s-rb2-5-4-hooded-chest-zip-wetsuit-wrb20254w0010.html","name":"Women's RB2 5/4 Hooded Chest Zip Wetsuit - 2021","brand":"Buell","sku":"BULWRB20254W0010","description":"Buell's ultimate year round wetsuit, RB2, is their warmest most watertight wetsuit yet. In order to push the barriers of this wetsuit's warmth potential \"Ninja Neoprene\" is used in combination with an internal thermal insulation barrier. The slant zip entry gives you a one-sided water seal to lock out the cold water, while the seams are glued and blind stitched with power-lite \"Sizzle\" seam seal on the outside. The insulated RB2 Slant-Zip, is our warmest most water tight wetsuit built for barrels.","price":"299.95","sizes":"4","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-womens-rb20254-rb2-5-4-chest-zip-wetsuit-front_1.jpg","style_id":"4","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-dawn-patrol-5-3-back-zip-wetsuit-wsm9ds.html","name":"Women's Dawn Patrol 5/3 Back Zip Wetsuit","brand":"Rip Curl","sku":"RIPWSM9DS","description":"Rip Curl's Women's Dawn Patrol 5/3 Back Zip Wetsuit is the ideal choice for performance-driven surfers. Sturdy and reliable, yet designed to provide exceptional warmth through its E5 Flash Lining and E5 neoprene - all of which are found in the company’s top-end offerings. Internally taped seams provide warmth and add durability. In addition, the back zip entry makes for a quick entry and exit. Incredible value combined with unbeatable quality makes this wetsuit a fantastic investment.","price":"237.96","sizes":"12,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-womens-dawn-patrol-5-3-back-zip-wetsuit-slate-rose-01_2.jpg","style_id":"4","gender":"Womens"}]