[{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-heat-5mm-round-toe-boots.html","name":"Heat 5mm Round Toe Boots","brand":"O'Neill","sku":"ONL4789","description":"The well-loved O'Neill Heat 5mm Round Toe Boots have grown a reputation as the workhorse of surf booties. These coldwater booties are built with soft, FluidFlex Neoprene and deliver all the features you need for solid performance with O'Neill's quality craftsmanship to ensure a long life of serotonin filled sessions. Offering plenty of warmth, a secure yet comfortable fit and superb durability, the Heat Boots are perfect for any surfer spending hours chasing those sumptuous cold water peaks.","price":"69.95","sizes":"5,6,7,8,9,10,11,12,13,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/4/7/4790_heat_5mm_rt.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/hotline-reflex-5mm-split-toe-boots.html","name":"Reflex 5mm Split Toe Boots","brand":"Hotline","sku":"HOT905","description":"The warm and reliable Hotline Reflex Split Toe 5mm Wetsuit Boots offer lasting comfort for long coldwater sessions. Developed in the frigid waters of Santa Cruz, Hotline's booties are designed to maximize board control, while minimizing heat loss. The innovative Sealed Split Toe offers the best of both worlds, combining the dexterity of a split toe with the protection of a round toe. Experience the durability and warmth of quality wetsuit booties in the Hotline Reflex Boots.","price":"90.95","sizes":"5,6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/5/m/5mm-107_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-seven-seas-5mm-round-toe-boots.html","name":"Seven Seas 5mm Round Toe Boots","brand":"Vissla","sku":"VISMWB5E7RT","description":"Vissla Seven Seas 5mm Round Toe Boots are made with everything you need and nothing you don't. True to the Vissla premise of less is more these wetsuit booties are designed to get you into cold waters and keep you there so you don't miss a set. Made with 100% Super Stretch neoprene that is lightweight, warm, soft and easy to pull on and off. Lined with Brain fuzz thermal hallow fiber to insulate your feet heat and dry fast between morning dawn patrols. The soft grip sole design lends to excellent board feel and the strapless compression panels keep the boots snug to your feet, eliminating the restrictive velcro strap. The Vissla Seven Seas booties are glued and blind stitched to keep water out so you'll get hungry before you get cold. These boots, like the rest of the Vissla wetsuit line, were made using eco-friendly neoprene: naturally sourced Limestone and dope dyed yarns.","price":"62.96","sizes":"7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/1/9/19204ad4f37deddb9368d095bf33677c_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-seven-seas-7mm-round-toe-boots-mwb7i7rt.html","name":"Seven Seas 7mm Round Toe Boots","brand":"Vissla","sku":"VISMWB7I7RT","description":"Vissla Seven Seas 7mm Round Toe Boots are made with everything you need and nothing you don't. True to the Vissla premise of less is more these wetsuit booties are designed to get you into the coldest of waters and keep you there so you don't miss a set. Made with 100% Super Stretch neoprene that is lightweight, warm, soft and easy to pull on and off. Lined with Thermal Brain Fuzz hallow fiber to insulate your feet heat and dry fast between morning dawn patrols. The soft grip sole design lends to excellent board feel and the strapless compression panels keep the boots snug to your feet, eliminating the restrictive velcro strap. The Vissla Seven Seas booties are glued and blind stitched to keep water out so you'll get hungry before you get cold. These boots, like the rest of the Vissla wetsuit line, were made using eco-friendly neoprene: naturally sourced Limestone and dope dyed yarns.","price":"74.95","sizes":"7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/v/i/vissla-seven-seas-7mm-mwb7i7rt-round-toe-boots-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r4-yulex-5mm-round-toe-boots.html","name":"R4 Yulex 5mm Round Toe Boots","brand":"Patagonia","sku":"PAT89439","description":"Now made from lighter and stretchier 5mm 85% natural rubber/15% synthetic rubber by polymer content, the updated Patagonia R4 Yulex 5mm Round Toe Boots keep your feet warm and comfortable while offering excellent control and dexterity in winter conditions. With a fast-drying 95% polyester (51% recycled)/5% spandex inverted microgrid thermal lining and an 88% recycled polyester/12% spandex face fabric, they have a round-toe design for maximum warmth, a flexible Supratex back for increased comfort and durability, and a micro gasket at the ankle cuff to help prevent water entry. Diamond-grip, nonmarking soles provide reliable traction, and a Y-Strap closure holds the bootie snug to your foot for extra support; the hook-and-loop patch is stretchy for increased flex as the foot and ankle move. Pull rings at the heels make the booties easy to get on and off, and are triple bartacked for strength. 100% external seam sealing eliminates leaks; all seams are triple glued and 100% internally taped. The face fabric and lining are now solution-dyed—using 86% less water than conventional dyeing—and are laminated with water-based AquaA glue that’s free from harmful volatile organic compounds (VOCs). The natural rubber content is from sources that are Forest Stewardship Council certified by the Rainforest Alliance. Made in a Fair Trade Certified facility. Suggested water temperatures: 38–48° F/3–9° C.","price":"99","sizes":"5,6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/9/89439_blk-flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-heat-7mm-round-toe-boots.html","name":"Heat 7mm Round Toe Boots","brand":"O'Neill","sku":"ONL4790","description":"The O'Neill Heat 7mm Round Toe Boots free you from the cold so you can focus on the waves, not your feet. These coldwater booties are built with soft, FluidFlex Neoprene and deliver all the features you need for solid performance with O'Neill's quality craftsmanship to ensure a long life of serotonin filled sessions. Offering plenty of warmth, a secure yet comfortable fit and superb durability, the Heat Boots are perfect for any surfer spending hours chasing those sumptuous cold water peaks.","price":"79.95","sizes":"6,7,8,9,10,11,12,13,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/4/7/4790_heat_5mm_rt_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r3-yulex-3mm-split-toe-boots.html","name":"R3 Yulex 3mm Split Toe Boots","brand":"Patagonia","sku":"PAT89437","description":"Now made from lighter and stretchier 3mm 85% natural rubber/15% synthetic rubber, the durable Patagonia R3 Yulex 3mm Split Toe Boots keep your feet warm and comfortable in cold water while offering excellent dexterity and control. With a fast-drying 95% polyester (51% recycled)/5% spandex inverted microgrid thermal lining and an 88% recycled polyester/12% spandex face fabric, they have an internal split toe and heel lock to improve performance, a flexible Supratex back for increased comfort and durability, and a micro gasket at the ankle cuff to help prevent water entry. Diamond-grip, nonmarking soles provide reliable traction, and a Y-strap closure holds the bootie snug to your foot for a snug fit; the hook-and-loop patch is stretchy for increased flex as the foot and ankle move. Pull rings at the heel make the booties easy to get on and off, and are triple bartacked for strength. 100% external seam sealing eliminates leaks; all seams are triple glued and internally taped. The lining and face fabric are now solution-dyed—using 86% less water than conventional dyeing—and are laminated with water-based AquaA glue that’s free from harmful volatile organic compounds (VOCs). The natural rubber content is derived from sources that are Forest Stewardship Council certified by the Rainforest Alliance. Made in a Fair Trade Certified facility. Suggested water temperatures: 48–55° F/9–13° C.","price":"99","sizes":"5,6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/9/89437_blk-flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/hotline-reflex-7mm-split-toe-boots.html","name":"Reflex 7mm Split Toe Boots","brand":"Hotline","sku":"HOT907","description":"Super toasty and built to last, the Hotline Reflex Split Toe 7mm Wetsuit Boots stand up to the elements of coldwater surfing. Developed in the frigid waters of Santa Cruz, Hotline's booties are designed to maximize board control, while minimizing heat loss. The innovative Sealed Split Toe offers the best of both worlds, combining the dexterity of a split toe with the protection of a round toe. Experience the durability and warmth of quality wetsuit booties in the Hotline Reflex Boots.","price":"106.95","sizes":"6,7,8,9,10,11,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/5/3/53780177ec036HOT90__24590_zoom.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/patagonia-r5-yulex-7mm-round-toe-boots.html","name":"R5 Yulex 7mm Round Toe Boots","brand":"Patagonia","sku":"PAT89442","description":"The Patagonia R5 Yulex boot is probably one of the warmest booties in the market. These wetsuit boots were designed for the extreme cold when dexterity is essential in frigid conditions. The lining inside is especially warm, made of a thermal microgrid so your feet stay toasty and the thoughtful design includes a watertight seam construction with a microgasket at the heel to prevent water entry. Made of natural rubber and sustainably made, these round toe boots are about to be your new favorite surf accessory.","price":"109","sizes":"5,6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/9/89442_blk-flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/hotline-reflex-5mm-round-toe-boots.html","name":"Reflex 5mm Round Toe Boots","brand":"Hotline","sku":"HOT905R","description":"We love Hotline here are Cleanline Surf and a lot of us use their booties. Why? Well, for a couple of reasons. They're warm, reliable, and they offer long-lasting comfort for long cold-water sessions. These Hotline 5mm surf booties were developed in the frigid waters of Santa Cruz. The boots are designed to maximize board control, while minimizing heat loss. The Hotline innovative Round Toe booties have the most durable sole on the market. Offering the highest protection from reefs and rough terrain to keep you safe, warm, and in the water longer!","price":"90.95","sizes":"6,7,8,9,10,11,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/1/0/106-_1_.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-5mm-hidden-split-toe-boots-wboyif.html","name":"Flashbomb 5mm Hidden Split Toe Boots - 2021","brand":"Rip Curl","sku":"RIPWBOYIF","description":"The Rip Curl Flashbomb 5mm Hidden Split Toe Boots are perfect for surfing in any weather. These boots are fully lined with Flash Lining and sealed with E5 tape providing increased stretch, warmth and comfort. The stitchless compression strap minimizes water entry while reducing lateral foot movement, ensuring you keep your best form on the board. They also feature the world's first super thin sole. A single layer 0.6mm sole delivers ultimate feel and hypersensitivity between you and your board without compromising durability. The rubberized outsole structure provides increased arch support and shape making these boots superior in fit and feel. To top off this high performing boot a built-in achiles strap stops bunching and helps the boot slide on easily so you can utilize your energy out on the waves rather than when you're putting on your gear.","price":"84.95","sizes":"6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-flashbomb-5mm-hidden-split-toe-boots-2021-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-reactor-2mm-reef-boots.html","name":"Reactor 2mm Reef Boots","brand":"O'Neill","sku":"ONL3285","description":"Protect your feet from the reef! The O'Neill Reactor Reef Shoe has durable 2mm neoprene construction that's meshed for water drainage and comfort. It's a slip-on type water shoe with a rubber sole and strong stitching ergonomically placed in the comfort zone. Beach, pool or your favorite snorkeling trip they're a must have. When you are trekking the waters of the world, protect your feet with the O'Neill Reef Boot Water Shoes.","price":"39.95","sizes":"5,6,7,8,9,10,11,12,13,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-reef-reactor-2mm-boot-black-blue.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-3mm-hidden-split-toe-boots-wboyhf.html","name":"Flashbomb 3mm Hidden Split Toe Boots - 2021","brand":"Rip Curl","sku":"RIPWBOYHF","description":"The Rip Curl Flashbomb 3mm Hidden Split Toe Boots are perfect for surfing in any weather. These boots are fully lined with Flash Lining and sealed with E5 tape providing increased stretch, warmth and comfort. The stitchless compression strap minimizes water entry while reducing lateral foot movement, ensuring you keep your best form on the board. They also feature the world's first super thin sole. A single layer 0.6mm sole delivers ultimate feel and hypersensitivity between you and your board without compromising durability. The rubberized outsole structure provides increased arch support and shape making these boots superior in fit and feel. To top off this high performing boot a built-in achiles strap stops bunching and helps the boot slide on easily so you can utilize your energy out on the waves rather than when you're putting on your gear.","price":"84.95","sizes":"6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-flashbomb-3mm-hidden-split-toe-boots-2021-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-heat-3mm-round-toe-boots.html","name":"Heat 3mm Round Toe Boots","brand":"O'Neill","sku":"ONL4788","description":"Be sure to keep your feet warm and your body temp up between sets, with your toes tucked into the O'Neill Heat 3mm Round Toe Boots. These cool water surf booties are built with soft, FluidFlex Neoprene and deliver all the features you need for solid performance with O'Neill's quality craftsmanship to ensure a long life of serotonin filled sessions. Offering reliable warmth, a secure yet comfortable fit and superb durability, the Heat Boots are perfect for any surfer spending hours chasing those irresistible empty peaks.","price":"59.95","sizes":"5,6,7,8,9,10,11,12,13,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/onl4788.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-heat-3mm-split-toe-boots.html","name":"Heat 3mm Split Toe Boots","brand":"O'Neill","sku":"ONL4787","description":"Add some spark to your surf booties with the performance-focused O'Neill Heat 3mm Split Toe Boots. These cool water booties are built with soft, FluidFlex Neoprene and deliver all the features you need for solid performance with O'Neill's quality craftsmanship to ensure a long life of serotonin filled sessions. Offering reliable warmth, a secure yet comfortable fit and superb durability, the Heat Boots are perfect for any surfer spending hours chasing those irresistible empty peaks.","price":"59.95","sizes":"5,6,7,8,9,10,11,12,13,14,15","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/onl4787.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-5mm-round-toe-boots-wboycf.html","name":"Flashbomb 5mm Round Toe Boots","brand":"Rip Curl","sku":"RIPWBOYCF","description":"The newest Rip Curl Flash Bomb 5mm Round Toe Boots are perfect for surfing in any weather. These boots are fully lined with Flash Lining and sealed with E5 tape providing increased stretch, warmth and comfort. The stitchless compression strap minimizes water entry while reducing lateral foot movement, ensuring you keep your best form on the board. They also feature the world's first super thin sole. A single layer 0.6mm sole delivers ultimate feel and hypersensitivity between you and your board without compromising durability. The rubberized outsole structure provides increased arch support and shape making these boots superior in fit and feel. To top off this high performing boot a built-in achiles strap stops bunching and helps the boot slide on easily so you can utilize your energy out on the waves rather than when you're putting on your gear.","price":"84.95","sizes":"6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/b/wboyjfcf_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-custom-pro-2-0-5mm-split-toe-boots.html","name":"Custom Pro 2.0 5mm Split Toe Boots","brand":"Solite","sku":"STE21002","description":"The 5mm Custom Pro 2.0 integrates Solite's new 3-Point Strap with the 2.0 Sole for precision fit and instant response. They've also upped the warmth even more with their new metal-grid Thermal Rebound plush lining.","price":"109.95","sizes":"7,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/t/ste21002b11-5_8.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-absolute-5mm-split-toe-boots-2021.html","name":"Absolute 5mm Split Toe Boots","brand":"Billabong","sku":"BILABYWW00110","description":"Billabongs 5mm Absolute Split Toe Boots are one of our best sellers. Made with recycled Superflex partially recycled Superlite Foam neoprene, these boots are warm, durable and eco-friendly. The hidden split toe helps to prevent your foot from moving around in the boot, increasing your performance ability with preventing leash hang-ups. The SIlicon Stretch lining keeps your movements flexible so you can stay comfortable and confident for as long as you are riding the waves.","price":"59.95","sizes":"6,8,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/a/b/abyww00110_billabong_v_ktq0_frt1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-dawn-patrol-5mm-round-toe-boots.html","name":"Dawn Patrol 5mm Round Toe Boots","brand":"Rip Curl","sku":"RIPWBO7CD","description":"Skip the snooze button and get out early in the Rip Curl Dawn Patrol 5mm Round Toe Boots. Stretchy E4 neoprene combined with dependable, strong glued and blind-stitched construction make up a solid piece of footwear to pursue your wave riding obsession. Streamlining your surf boot to focus on the most important and critical functions, the Dawn Patrol offers all you need while leaving out the clutter.","price":"59.95","sizes":"6,7,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/ripwbo5ad_3_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-super-7mm-split-toe-boots-2021.html","name":"Super 7mm Split Toe Boots","brand":"Buell","sku":"BULWSB23577U0010","description":"The Buell SUPER BOOTIE features a “covert” split-toe design that eliminates any worries about getting your leash caught between your toes. Super Booties come equipped with seams that are both glued and blind-stitched, creating a flexible, external water barrier, thermal insulation, and ankle stabilization. The ultra-soft sole provides incredible “board-feel” and superior, Ninja-grade traction.","price":"72.95","sizes":"6,7,8,9,10,11,12,13,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/bulwsb23577u0010_flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-seven-seas-3mm-split-toe-boots.html","name":"Seven Seas 3mm Split Toe Boots","brand":"Vissla","sku":"VISMWB3A7ST","description":"Vissla Seven Seas 3mm Split Toe Boots are made with everything you need and nothing you don't. True to the Vissla premise of less is more these wetsuit booties are designed to get you into the coldest of waters and keep you there so you don't miss a set. Made with 100% Super Stretch neoprene that is lightweight, warm, soft and easy to pull on and off with the sleek and simple pull tab. Thermal lining to insulate and heat your feet and dries fast between morning dawn patrols. The soft grip sole design lends to excellent board feel with a solid sole underneath the split toe to prevent leash hangups. The strapless compression panels keep the boots snug to your feet, eliminating the restrictive velcro strap. The Vissla Seven Seas booties are glued and blind stitched to keep water out so you'll get hungry before you get cold. These boots, like the rest of the Vissla wetsuit line, were made using eco-friendly neoprene: naturally sourced Limestone and dope dyed yarns.","price":"69.95","sizes":"6,7,8,9,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/8/3/83ac5c4b82984dfcc6f77e6f85788db9_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-superfreak-2mm-split-toe-boots.html","name":"Superfreak 2mm Split Toe Boots","brand":"O'Neill","sku":"ONL4124","description":"The O'Neill Superfreak 2mm Split Toe Boots are perfect for spending time getting barreled in the tropics. Built with expertly designed features and the attention to detail you have come to expect from O'Neill.","price":"59.95","sizes":"5,6,7,8,9,10,11,12,13,14","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/onl4124_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/volcom-5mm-hidden-split-toe-boots-a9932201.html","name":"5mm Hidden Split Toe Boots","brand":"Volcom","sku":"VOLA9932201","description":"The Volcom 5mm Hidden Split Toe Booties are the ultimate cold-water accessory! They’re built with a single layer, rubber molded sole that keeps your toes toasty without sacrificing board feel. They also feature a neoprene padded velcro arch strap to keep everything locked in place and an internal split toe baffle. This offers the warmth of a round toe with the stability of a split toe. The no stitch, fused heel also makes these booties a breeze to put on and take off.","price":"79.95","sizes":"6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/v/o/volcom-boots-a9932201-5mm-rt-black-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-superfreak-2mm-round-toe-boots.html","name":"Superfreak 2mm Round Toe Boots","brand":"O'Neill","sku":"ONL4125","description":"The O'Neill Superfreak 2mm Round Toe Boots are perfect for spending time getting barreled in the tropics. Built with expertly designed features and the attention to detail you have come to expect from O'Neill.","price":"59.95","sizes":"5,6,7,8,9,10,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/4/1/4125_rt_reef_boot.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-custom-pro-2-0-3mm-split-toe-boots.html","name":"Custom Pro 2.0 3mm Split Toe Boots","brand":"Solite","sku":"STE21001","description":"The 3mm Custom Pro 2.0 integrates Solite's new 3-Point Strap with the 2.0 Sole for precision fit and instant response. They've also upped the warmth even more with their new metal-grid Thermal Rebound plush lining.","price":"104.95","sizes":"7,8,9,10,11,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/t/ste21001g10-3_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-e-bomb-3mm-split-toe-boots-wbo7em.html","name":"E-Bomb 3mm Split Toe Boots","brand":"Rip Curl","sku":"RIPWBO7EM","description":"Incredibly lightweight, the Rip Curl E-Bomb 3mm Split Toe Boots are dialed in for action. Offering a responsive split toe design, these minimalist booties forge cool waters delivering nimble performance and reliable protection. Super soft soles, a cuffed chimney to minimize water entry and high caliber E5 neoprene ensure comfort session after session. Take off in the E-Bomb 3mm Surf Booties for feather-light footwork from a company that creates quality gear, made to enhance the search.","price":"69.95","sizes":"6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/ripwbo7em.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-performance-3mm-split-toe-boots.html","name":"Women's Performance 3mm Split Toe Boots","brand":"Roxy","sku":"RXYERJWW03017","description":"Women are built differently so why should you wear men's wetsuit booties? Like anything Roxy, the Roxy Women's Performance 3mm Split Toe Boots are designed exclusively for women. Women's specific booties will fit your feet better since we have a wider toe box and narrower heel. This means less slop in your boot so you have better board feel and less water entry. Best of all the Performance Bootie is lined with WarmFlight Far infrared lining that traps heat in so your feet stay toasty warm between sets. For a secure fit, an instep strap has been added. And for ease of getting in and out of your booties, the Performance Bootie features a loop pull at the heel: a definite luxury when trying to pull your wet, suction-cupped booties off.","price":"35.97","sizes":"4,5,6,7,8,9","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/e/r/erjww03017_30performancesplittoeboot_p_kvj0_frt2_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/wetsox-original-0-5mm-round-toe-socks.html","name":"Original 0.5mm Round Toe Socks","brand":"Wetsox","sku":"WTSWSRTBLK","description":"When the water temperature drops and you need extra warmth, enjoy a long cold session wearing the Wetsox Original Round Toe Socks. Constructed from the perfect combination of four-way stretch and neoprene, these round toe socks feature nylon flatlock stitching for durability and supreme comfort. The extra layer will help conserve the energy and heat while increasing the overall life of your gear. Not only are these socks super comfortable, the snug-fit eliminates the friction between you and your gear making it faster and easier to get in and out of your wetsuit.","price":"23.99","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/t/wtswsrtblk-1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-7mm-round-toe-boots-wboyjf.html","name":"Flashbomb 7mm Round Toe Boots","brand":"Rip Curl","sku":"RIPWBOYJF","description":"The newest Rip Curl Flash Bomb 7mm Round Toe Boots are perfect for surfing in any weather. These boots are fully lined with Flash Lining and sealed with E5 tape providing increased stretch, warmth and comfort. The stitchless compression strap minimizes water entry while reducing lateral foot movement, ensuring you keep your best form on the board. They also feature the world's first super thin sole. A single layer 0.6mm sole delivers ultimate feel and hypersensitivity between you and your board without compromising durability. The rubberized outsole structure provides increased arch support and shape making these boots superior in fit and feel. To top off this high performing boot a built-in achiles strap stops bunching and helps the boot slide on easily so you can utilize your energy out on the waves rather than when you're putting on your gear.","price":"89.95","sizes":"7,8,9,10,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/b/wboyjfcf.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-dawn-patrol-3mm-round-toe-boots.html","name":"Dawn Patrol 3mm Round Toe Boots","brand":"Rip Curl","sku":"RIPWBO7DD","description":"Making basic that much better are the Rip Curl Dawn Patrol 3mm Round Toe Boots. Stretchy E4 neoprene combined with dependable, strong glued and blind-stitched construction make up a solid piece of footwear to pursue your wave riding obsession. Streamlining your surf boot to focus on the most important and critical functions, the Dawn Patrol offers all you need while leaving out the clutter.","price":"59.95","sizes":"6,7,8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/ripwbo5ad_3_1_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vissla-high-seas-3mm-split-toe-boots.html","name":"High Seas 3mm Split Toe Boots","brand":"Vissla","sku":"VISMWB3QHSB","description":"Vissla High Seas 3mm Split Toe Boots are made for cold water, with a quick-drying insulation to keep you warm in waters 50 - 58° F. Made with 100% Super Stretch neoprene that is lightweight, warm and soft, with a glued and blind stitched construction. These boots fit true to shoe size so you can be confident in your purchase and your abilities out on the water. The High Seas boots have some excellent features at a great price. The pull tab heel is appreciated for its ease of pulling booties on and off. The soft grip sole design lends to excellent board feel and the sole is solid underneath the split toe to prevent leash hang-ups. The clean design of strapless compression panels keep the boots snug to your feet, eliminating the restrictive velcro strap. Truly light at half the weight of the Seven (7) Seas Booties yet packed with warmth and all the right features. These boots, like the rest of the Vissla wetsuit line, were made using eco-friendly neoprene: naturally sourced Limestone and dope dyed yarns.","price":"64.95","sizes":"7,8,9,11,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/5/7/577c00e34dffe8a9f0ea303b90cd4e9e_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/h2odyssey-5mm-ultra-sock.html","name":"5mm Ultra Sock","brand":"H2Odyssey","sku":"H2OBK105","description":"The H2Odyssey Ultra Sock is a neoprene sock made to keep your feet snug and comfortable inside your swim fins. They come with a built in fin tether made of velcro. Double blindstitched for minimum water penetration for cold to frigid water temps.","price":"27.95","sizes":"XS,S,M,L,XL,XXL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/7/b/7bf13cc7-9fc0-4a3c-a398-28e42d2abc72_ebc5daf4-eae3-4b08-b0ed-ec5fc3fbf404_1024x1024_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/wetsox-therms-1mm-split-toe-socks.html","name":"Therms 1mm Split Toe Socks","brand":"Wetsox","sku":"WTSTRSTBLK","description":"Slip on the Wetsox Therms Split Toe Socks to enjoy the water when the temperatures drop. Constructed from the perfect combination of four-way stretch and neoprene, these split toe socks feature nylon flatlock stitching for durability and supreme comfort. The extra layer will help conserve the energy and heat while increasing the overall life of your gear. Not only are these socks super comfortable, the snug-fit eliminates the friction between you and your gear making it faster and easier to get in and out of your wetsuit.","price":"31.99","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/t/wtstrstblk-1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-custom-2-0-5mm-split-toe-boots.html","name":"Custom 2.0 5mm Split Toe Boots","brand":"Solite","sku":"STE21007","description":"The 5mm Custom integrates Solite's 2.0 Sole in the cleanest, simplest package that essentially disappears on your feet. If you want the world's lightest, barely-there boot, the 5mm Custom 2.0 is your answer.","price":"89.95","sizes":"8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/t/ste21007b10-5.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-ninja-5mm-hidden-split-toe-boots-wnja3355u0010.html","name":"Ninja 5mm Hidden Split Toe Boots","brand":"Buell","sku":"BULWNJA3355U0010","description":"Ninjas operate in stealth mode and prefer footwear which is soft and strong, yet light and nimble. Care to combat icy water without reservations? Slide into a pair of Buell “Ninja” Boots and prepare to be amazed at how well they protect your tender toes against the bitter cold and feel the tremendous traction gluing you to your board as you do battle with the lip.\n\nBuell Surf Ninja Boots feature a “covert” split-toe design that eliminates any worries about getting your leash caught between your toes. Featuring the lightest, stretchiest and softest neoprene material in the water. With roughly 30% less water absorption, dries quicker and is limestone, so it’s better for the environment. Ninja Boots come equipped with seams that are both glued and blind-stitched, creating a flexible, external water barrier. The ultra-soft sole provides incredible “board-feel” and superior, Ninja-grade traction.","price":"65.95","sizes":"6,7,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-ninja-5mm-split-toe-wetsuit-boot-black.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-super-5mm-split-toe-boots.html","name":"Super 5mm Split Toe Boots","brand":"Buell","sku":"BULWSB23555U","description":"The Buell SUPER BOOTIE features a “covert” split-toe design that eliminates any worries about getting your leash caught between your toes. Super Booties come equipped with seams that are both glued and blind-stitched, creating a flexible, external water barrier, thermal insulation, and ankle stabilization. The ultra-soft sole provides incredible “board-feel” and superior, Ninja-grade traction.","price":"69.95","sizes":"6,8,9,10,11,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-super-5mm-split-toe-booties-black-red-05_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-super-7mm-round-toe-boots-wrsb3577u001220.html","name":"Super 7mm Round Toe Boots","brand":"Buell","sku":"BULWRSB3577U001220","description":"The new Round Toe Booties are the first of their kind in the Buell surf boot lineup. These not only measure in at one of their thickest and warmest, but also are the only boots from them to have a rounded toe bed. Super Booties come equipped with seams that are both glued and blind-stitched, creating a flexible, external water barrier, thermal insulation, and ankle stabilization. The ultra-soft sole provides incredible “board-feel” and superior, Ninja-grade traction.","price":"89.95","sizes":"6,7,8,9,10,11,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/buell-boots-wrsb3577u001220-super-7mm-rt-black.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-5mm-hidden-split-toe-boots.html","name":"Women's Synergy 5mm Hidden Split Toe Boots","brand":"Billabong","sku":"BILABJWW00103","description":"Stay core on the outside and cozy on the inside with the 5mm Synergy Boots. Built with Superlight recycled neoprene lined with silicone stretch throughout, this women's hidden split toe wetsuit boot provides superior heat and durability and value for cold water sessions.","price":"59.95","sizes":"6,8,9","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-womens-synergy-5mm-hidden-split-toe-boots-01_2.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/sisstrevolution-women-s-3mm-split-toe-boot.html","name":"Women's 3mm Split Toe Boot","brand":"Sisstrevolution","sku":"SISGA01OPTB","description":"WARMTH & STRETCH. Lighter, Warmer, Softer, and Stretchier! Easier to put on and take off. Full thermal lining insulates heat and dries fast. Sisstrevolution bringing you the best in cold water necessities.","price":"59.95","sizes":"5,6,7,8,9,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/i/sisstrevolution-womens-3mm-split-toe-wetsuit-boot.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/wetsox-therms-1mm-round-toe-socks.html","name":"Therms 1mm Round Toe Socks","brand":"Wetsox","sku":"WTSTRRTBLK","description":"Add an extra layer of warmth before hitting up those the cold-water waves with the Wetsox Therms Round Toe Socks. Constructed from the perfect combination of four-way stretch and neoprene, these round toe socks feature nylon flatlock stitching for durability and supreme comfort. The extra layer will help conserve the energy and heat while increasing the overall life of your gear. Not only are these socks super comfortable, the snug-fit eliminates the friction between you and your gear making it faster and easier to get in and out of your wetsuit.","price":"31.99","sizes":"S,M,L,XL","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/t/wtstrrtblk-3.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vans-surf-boot-hi-3mm-split-toe-boots-vn0a5ky9.html","name":"Surf Boot Hi 3mm Split Toe Boots","brand":"Vans","sku":"VANVN0A5KY9","description":"This is the boot you’ve been waiting for. Designed to keep you “Off The Wall” and in the water, the Surf Boot Hi ST 3mm has been built to exceed the needs of the Vans team, every inch and every stitch crafted for comfort and performance in all conditions. Between the legendary Vans micro-waffle grip and the split-toe construction that keeps the big toe separate, this surf bootie offers unmatched control and unfiltered board-feel at any contact point. It also includes a dual rubber-dipped construction for structure and warmth with optimal flexibility, a second-skin fit that puts nothing between you and your board, and a gusseted top that helps maintain a nice bootie-to-leg seal. The big brother to the Surf Boot Mid, this split toe surf bootie is Vans’ cold water bootie, designed with all the Vans DNA for the diehard fan.","price":"84.95","sizes":"7,8,9,10,11,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/v/a/vans-vn0a5ky9bka1-surf-boot-hi-3mm-st-black-black-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-reefer-low-1-5mm-split-toe-boots-wbooat.html","name":"Reefer Low 1.5mm Split Toe Boots","brand":"Rip Curl","sku":"RIPWBOOAT","description":"The Rip Curl Reefer Booties are great for warm and cool water, and offer protection for your feet from the rough ground. With a low profile design, a barrel lock closure and a compression strap across the foot, these tropical surf boots are sure to stay snug on your feet while remaining lightweight and comfortable.","price":"49.95","sizes":"6,7,8,9,11,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/ripwbooat.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-dawn-patrol-3mm-split-toe-boots.html","name":"Dawn Patrol 3mm Split Toe Boots","brand":"Rip Curl","sku":"RIPWBO7AD","description":"Get more freedom and dexterity out on the surf wearing the Rip Curl Dawn Patrol Split Toe Boots. This high-performance boot is made from super stretchy and flexible neoprene and is sealed with dependable seams to keep the cold water out. A built-in pull-tab system makes it easy to slide in and out of the boot, while the durable and textured sole gives you a barefoot feel.","price":"54.95","sizes":"6,7,8,9,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/w/b/wbo7cd_black_1_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-women-s-synergy-3mm-hidden-split-toe-boots.html","name":"Women's Synergy 3mm Hidden Split Toe Boots","brand":"Billabong","sku":"BILABJWW00102","description":"Stay core on the outside and cozy on the inside with the Women's 3mm Synergy Boots. Built with Superlight recycled neoprene lined with silicone stretch throughout, the women’s hidden split toe wetsuit boot provides superior heat, durability, and value.","price":"49.95","sizes":"5,6,8,9,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-womens-synergy-3mm-hidden-split-toe-boots-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/o-neill-women-s-hyperfreak-fire-3mm-split-toe-boots-5557.html","name":"Women's Hyperfreak Fire 3mm Split Toe Boots","brand":"O'Neill","sku":"ONL5557","description":"Stay covered Head-to-Toe in O'Neill's premium lineup of equipment designed to shield you from the harshest conditions. O'Neill's world-class athletes search the planet for perfect surf, the R&D team at Area 52 developed product to allow you to perform in the most extreme elements and excel in the coldest climates.","price":"74.95","sizes":"7,8,9,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/o/n/oneill-womens-hyperfreak-fire-3mm-split-toe-boots-5557-blk-tidepool.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-custom-fire-2-0-8mm-round-toe-boots-22012.html","name":"Custom Fire 2.0 8mm Round Toe Boots","brand":"Solite","sku":"STE22012","description":"The Solite 8mm Fire gets the Solite 2.0 technology upgrade for Winter 2023. The 8mm Custom Fire 2.0 integrates the new Solite 3-Point Strap with the 2.0 Sole for precision fit, instant response, and enhanced durability and protection. Simply put, our 8mm Custom Fire 2.0 is the best cold-water boot in the world. Full stop.","price":"129.95","sizes":"8,9,10,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-boots-22012-2022_custom-fire-8mm-rt-red-black-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-custom-2-0-3mm-hidden-split-toe-boots-21004.html","name":"Custom 2.0 3mm Hidden Split Toe Boots","brand":"Solite","sku":"STE21004","description":"Simply Game-Changing. Again. Solite changed the bootie-game again with their Solite 2.0 technology. The 3mm Custom integrates the Solite 2.0 Sole in the cleanest, simplest package that essentially disappears on your feet. If you want the world's lightest, barely-there boot, the 3mm Custom 2.0 is your answer.","price":"84.95","sizes":"7,8,9,10,11,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-21004g-2022-custom-2-0-3mm-st-green-black.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-reef-walker-boots.html","name":"Reef Walker Boots","brand":"Rip Curl","sku":"RIPWBO6AM","description":"Keep feet coral-free on your next rugged landscape adventure with the Rip Curl Reef Walker Boots. The Reefwalker low ankle boot is designed for beach or reef walking, not surfing. This boot offers protection and comfort with an easy slip on entry. Perfect for cool to warm conditions, the Reef Walkers are made from a lightweight mesh that stay snug on your feet for barely-there comfort. The coral-proof sole offers protection to your feet and provides the traction needed on rough surfaces.","price":"39.95","sizes":"8,9,10,11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/rip-curl-wbo6am-reefwalker-low-boots-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-women-s-flashbomb-3mm-split-toe-boots-wbo7cw.html","name":"Women's Flashbomb 3mm Split Toe Boots","brand":"Rip Curl","sku":"RIPWBO7CW","description":"Offering true cool water protection, the Rip Curl Women's Flash Bomb 3mm Split Toe Boots are specifically shaped for the feminine foot. Starting with a soft and cozy Flash Lining and then internally sealing the seams with flexible Flashline tape, the Flash Bomb Boots envelop your feet in a capsule of warmth and comfort. A unique slide on system that utilizes an inbuilt Achilles strap makes for easy on and off, while the performance engineered single layer 0.8mm sole delivers the much sought after hypersensitivity between you and your board. With an anti microbial treatment that helps to chase away stinky bootie smell and two compression straps that are built into the rubberized support structure with watertight stitchless technology the Rip Curl Women's Flash Bomb Split Toe Boots bundle all the best features for the ultimate surf boot.","price":"63.96","sizes":"5,9,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/ripwbo7cw.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/dakine-5mm-round-toe-boots.html","name":"5mm Round Toe Boots","brand":"Dakine","sku":"DKNDK21U5RB","description":"The Dakine Round Toe Boots are the product of many years of research. The RT is Dakine's vision of a designed for any water based activity and adventure. They designed the boot around the environments and created something purpose built for the activities we all love to do in the water. Initially, these are based around commercial activities of outdoor centers, whitewater and surf rental - the most hard wearing uses. The RT’s durability has a lot to do with the fine details in the construction. You'll be ready to romp-stomp along the river and trails. Go rock hop or dunk 'em in some surf!","price":"50","sizes":"11,12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/d/k/dk21u5rb_rt_boot-flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/dakine-cyclone-5-4mm-hidden-split-toe-boots.html","name":"Cyclone 5/4mm Hidden Split Toe Boots","brand":"Dakine","sku":"DKNDK21U5STB","description":"THE CYCLONE SPLIT TOE BOOT – GRIP / WARMTH / COMFORT\nThe Cyclone Split Toe Boots fit both women and men perfectly and offers everything you can wish for in a modern neoprene boot. With a combination of 4mm and 5mm thick neoprene, you retain top mobility without loosing warmth. The boot also offers the proven DK_Hexo_Therm lining and sealed silicone seams.\n\nFor the best grip on your board the Cyclone booties feature a sole with different textures and a split toe design. The reinforced heel and arch strap provide plenty of grip and make the boots highly durable. Pull tabs for easy access are also incorporated.","price":"90","sizes":"12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/d/k/dk21u5stb_cyclone_5mm_splittoe_boot-flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/vans-surf-boot-hi-v-5mm-round-toe-boots-vn0a5aod.html","name":"Surf Boot Hi V 5mm Round Toe Boots","brand":"Vans","sku":"VANVN0A5AOD","description":"Built to keep you “Off The Wall” and in the water, this is the boot you’ve been waiting for. Built to exceed the needs of the Vans team, every inch and every stitch has been crafted for comfort and performance to bring your style to life in all conditions. Placing a premium on board-feel and grip, the Surf Boot 2 Hi V 5mm takes everything Vans knows about skate shoes and packages it up in a surf bootie. Featuring a round toe construction for universal fit, liquid rubber dipped around the foot shape for warmth and support, and a hook-and-loop strap for maximum adjustability, the Surf Boot 2 Hi V 5mm offers the next generation of pure performance without sacrificing style.","price":"89.95","sizes":"7,8,10,12","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/v/a/vans-vn0a5aodenr-surf-boot-2-hi-v-5mm-rt-black-black-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/buell-super-3mm-split-toe-boots-2021.html","name":"Super 3mm Split Toe Boots","brand":"Buell","sku":"BULWSB23533U0010","description":"The Buell SUPER BOOTIE features a “covert” split-toe design that eliminates any worries about getting your leash caught between your toes. Super Booties come equipped with seams that are both glued and blind-stitched, creating a flexible, external water barrier, thermal insulation, and ankle stabilization. The ultra-soft sole provides incredible “board-feel” and superior, Ninja-grade traction.","price":"66.95","sizes":"7,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/u/bulwsb23533u0010.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/h2odyssey-3mm-ultra-sock.html","name":"3mm Ultra Sock","brand":"H2Odyssey","sku":"H2OBK10","description":"The H2Odyssey Ultra Sock is a neoprene sock made to keep your feet snug and comfortable inside your swim fins. They come with a built in fin tether made of velcro. Double blindstitched for minimum water penetration for cold to frigid water temps.","price":"24.95","sizes":"XS,L","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/h/2/h2obk10blk-h20dyssey-ultra-sock-3mm-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/solite-custom-2-0-8mm-round-toe-boots-22014.html","name":"Custom 2.0 8mm Round Toe Boots","brand":"Solite","sku":"STE22014","description":"For Winter 2023, the Solite 8mm Custom gets the Solite 2.0 sole upgrade, changing the game again for barefoot feel, performance, warmth, and durability in the most frigid conditions. The 8mm Custom 2.0 integrates the Solite 2.0 Sole in the cleanest, simplest package that essentially disappears on your feet. If you want the world's lightest, barely-there boot, the 8mm Custom 2.0 is your answer.","price":"109.95","sizes":"8,10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/o/solite-boots-22014-2023-custom-8mm-rt-red-black-01.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/sisstrevolution-women-s-5mm-round-toe-boot.html","name":"Women's 5mm Round Toe Boot","brand":"Sisstrevolution","sku":"SISGA02CLTB","description":"WARMTH & STRETCH. Lighter, Warmer, Softer, and Stretchier! Easier to put on and take off. Full thermal lining insulates heat and dries fast. Sisstrevolution bringing you the best in cold water necessities.","price":"59.95","sizes":"10","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/s/i/sisstrevolution-womens-5mm-round-toe-wetsuit-boot.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/dakine-cyclone-7-5mm-round-toe-boots.html","name":"Cyclone 7/5mm Round Toe Boots","brand":"Dakine","sku":"DKNDK21U7RTB","description":"THE CYCLONE ROUND TOE BOOT – GRIP / WARMTH / COMFORT\nThe Cyclone Round Toe Boots fit both women and men perfectly and offers everything you can wish for in a modern neoprene boot. With a combination of 5mm and 7mm thick neoprene, you retain top mobility without loosing warmth. The boot also offers the proven DK_Hexo_Therm lining and sealed silicone seams.\n\nFor the best grip on your board the Cyclone booties feature a sole with different textures and a round toe design. The reinforced heel and arch strap provide plenty of grip and make the boots highly durable. Pull tabs for easy access are also incorporated.","price":"95","sizes":"12,13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/d/k/dk21u7rtb_cyclone_roundtoe_boot-flip.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/rip-curl-flashbomb-3mm-split-toe-boots-wbo7hf.html","name":"Flashbomb 3mm Split Toe Boots","brand":"Rip Curl","sku":"RIPWBO7HF","description":"Find out why the Rip Curl Flash Bomb 3mm Split Toe Boots are at the top of the list for many seasoned surfers. Starting with a soft and cozy Flash Lining and then internally sealing the seams with flexible Flashline tape, the Flash Bomb Boots envelop your feet in a capsule of warmth and comfort. A unique slide on system that utilizes an inbuilt Achilles strap makes for easy on and off, while the performance engineered single layer 0.8mm sole delivers the much sought after hypersensitivity between you and your board. With an antimicrobial treatment that helps to chase away stinky bootie smell and two compression straps that are built into the rubberized support structure with watertight stitchless technology the Rip Curl Flash Bomb Split Toe Boots bundle all the best features for the ultimate surf boot.","price":"55.96","sizes":"13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/r/i/ripwbo7hf1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-furnace-carbon-ultra-3mm-split-toe-boots.html","name":"Furnace Carbon Ultra 3mm Split Toe Boots","brand":"Billabong","sku":"BILMWBOVBX3","description":"The warmest boots in the line-up, the Billabong Furnace Carbon Ultra 3mm Split Toe Boots are lined with Graphene to trap heat so your feet stay toasty warm. To keep water out the external seams have been welded and the O ring entry design keeps your boots snug and for pull on and off assistance, you'll appreciate the heel toggle.","price":"45.57","sizes":"13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/b/i/billabong-furnace-carbon-ultra-3mm-split-toe-boots.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/roxy-women-s-syncro-5mm-round-toe-boots.html","name":"Women's Syncro 5mm Round Toe Boots","brand":"Roxy","sku":"RXYERJWW03013","description":"Women are built differently so why should you wear men's wetsuit booties? Like anything Roxy, the Roxy Women's Syncro 5mm Round Toe Boots are designed exclusively for women. Women's specific booties will fit your feet better since we have a wider toe box and narrower heel. This means less slop in your boot so you have better board feel and less water entry. Plus the seams are Glued and Blindstitched for minimal water seepage and 5mm of neoprene is used so your feet will stay toasty warm between sets. For a secure fit, an instep strap has been added. And for ease of getting in and out of your booties, the Syncro Bootie features a loop pull at the heel: a definite luxury when trying to pull your wet, suction-cupped booties off.","price":"32.97","sizes":"4","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/e/r/erjww03011_30syncroroundtoeboot_p_kvj0_frt2_1.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/quiksilver-syncro-3mm-split-toe-boots.html","name":"Syncro 3mm Split Toe Boots","brand":"Quiksilver","sku":"QKSEQYWW03042","description":"Eliminate the chill as you wait for the next set with the Quiksilver Syncro 3mm Split Toe Boots. Flexible Freemax neoprene paired with a durable glued and blindstitched construction creates an affordable and reliable surf boot. Year after year the Syncro Bootie stays at the top of the pack for value-driven performance from a brand that has been in the lineup for decades.","price":"26.97","sizes":"13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/e/q/eqyww03042_30syncrosplittoeboot_p_kvj0_frt2.jpg","style_id":"6","gender":"Womens"},{"retailer_id":"CL1","url":"https://www.cleanlinesurf.com/billabong-abolute-3mm-split-toe-boots.html","name":"Abolute 3mm Split Toe Boots","brand":"Billabong","sku":"BILMWBO3BA3","description":"Stay light on your feet and on your finances with the Furnace Absolute Wetsuit Boot. Made with an eco-minded Superlight foam core and silicone stretch jersey lining, the hidden split-toe wetsuit boot provides light weight matched with superior thermal retention. A new, slim-line fit also offers an even better board feel.","price":"27.57","sizes":"13","image":"https://media.cleanlinesurf.com/catalog/product/cache/9b972933aab2775f67c7f8e2e70ccb93/m/w/mwbo3ba3_billabong_v_blk_sd1.jpg","style_id":"6","gender":"Womens"}]